doraorak/ESP32Firmata/ESP32Firmata.ino
/*
 * ESP32Firmata.ino — Firmata 2.x firmware for the original ESP32 (C++/Arduino).
 *
 * Self-contained (no external Firmata library). Speaks Firmata over three
 * transports — Wi-Fi/TCP + Bonjour, BLE Nordic UART (NimBLE), and USB serial
 * (first byte claims the session and silences the console) — one master at a
 * time, latest wins; scheduler tasks survive eviction and disconnect. Includes
 * the on-device task extension: registers, branches, arithmetic, HTTP(S) +
 * JSON/string inspection, nested tasks (ext ops 0x10–0x30 — byte-identical to
 * ESP32FirmataSwift; wire spec in that repo's README). ENABLE_WIFI/ENABLE_BLE
 * gate the radio transports at compile time.
 */

/* ==== USER CONFIGURATION ================================================ */

#define ENABLE_WIFI        1          // Wi-Fi/TCP + Bonjour   (set 0 to disable)
#define ENABLE_BLE         1          // BLE Nordic UART Svc   (set 0 to disable)

// --- Wi-Fi / Bonjour settings (used when ENABLE_WIFI == 1) -----------------
#define WIFI_SSID          "YOUR_WIFI_SSID"
#define WIFI_PASS          "YOUR_WIFI_PASSWORD"
#define MDNS_HOSTNAME      "esp32-firmata"   // also the Bonjour instance name
#define FIRMATA_TCP_PORT   3030              // must match BonjourTransport default

// --- BLE settings (used when ENABLE_BLE == 1) -----------------------------
#define BLE_DEVICE_NAME    "Firmata-ESP32"   // optional BLE name filter for clients

#if !ENABLE_WIFI && !ENABLE_BLE
#error "Enable at least one transport (ENABLE_WIFI and/or ENABLE_BLE)."
#endif

// --- Firmware identity (sent in the firmware-report message) --------------
#define FIRMWARE_NAME      "FirmataESP32"
#define FIRMWARE_MAJOR     2
#define FIRMWARE_MINOR     21
#define PROTOCOL_MAJOR     2
#define PROTOCOL_MINOR     8

/* ==== Core-version helper (3.x vs 2.x differ for PWM / LEDC APIs) ======= */
#if defined(ESP_ARDUINO_VERSION) && defined(ESP_ARDUINO_VERSION_VAL)
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    #define FIRMATA_CORE3 1
  #endif
#endif

/* ==== Transport-specific includes ======================================= */
#if ENABLE_WIFI
  #include <esp_log.h>
#include <WiFi.h>
  #include <ESPmDNS.h>
  #include <HTTPClient.h>          // internet actions (scheduler extension)
  #include <WiFiClientSecure.h>    // HTTPS (TLS via ssl_client / mbedTLS)
  // IDF certificate bundle (browser-like root CA set) — validates HTTPS certs.
  // The arduino-esp32 core embeds it (CONFIG_MBEDTLS_CERTIFICATE_BUNDLE).
  extern const uint8_t fm_crt_bundle_start[] asm("_binary_x509_crt_bundle_start");
  extern const uint8_t fm_crt_bundle_end[]   asm("_binary_x509_crt_bundle_end");
  #include <Preferences.h>          // NVS — persist BLE-provisioned Wi-Fi creds
  #include <esp_random.h>           // hardware RNG for the provisioning handshake
  #include <mbedtls/ecdh.h>         // X25519 ECDH ─┐ encrypted Wi-Fi provisioning
  #include <mbedtls/ecp.h>          //              │ (see WIFI_CONFIG below)
  #include <mbedtls/bignum.h>       //              │
  #include <mbedtls/gcm.h>          // AES-256-GCM ─┤
  #include <mbedtls/hkdf.h>         // HKDF-SHA256 ─┘
  #include <mbedtls/md.h>
  #include <mbedtls/platform_util.h>  // mbedtls_platform_zeroize
#endif
#if ENABLE_BLE
  #include <NimBLEDevice.h>   // NimBLE uses far less heap than Bluedroid — leaves
                              // room for a TLS (HTTPS) handshake alongside Wi-Fi.
#endif
#include <Wire.h>

/* ==== Firmata protocol constants ======================================== */
static const uint8_t ANALOG_MESSAGE        = 0xE0;
static const uint8_t DIGITAL_MESSAGE       = 0x90;
static const uint8_t REPORT_ANALOG         = 0xC0;
static const uint8_t REPORT_DIGITAL        = 0xD0;
static const uint8_t SET_PIN_MODE          = 0xF4;
static const uint8_t SET_DIGITAL_PIN_VALUE = 0xF5;
static const uint8_t REPORT_VERSION        = 0xF9;
static const uint8_t SYSTEM_RESET          = 0xFF;
static const uint8_t START_SYSEX           = 0xF0;
static const uint8_t END_SYSEX             = 0xF7;

static const uint8_t ANALOG_MAPPING_QUERY    = 0x69;
static const uint8_t ANALOG_MAPPING_RESPONSE = 0x6A;
static const uint8_t CAPABILITY_QUERY        = 0x6B;
static const uint8_t CAPABILITY_RESPONSE     = 0x6C;
static const uint8_t PIN_STATE_QUERY         = 0x6D;
static const uint8_t PIN_STATE_RESPONSE      = 0x6E;
static const uint8_t EXTENDED_ANALOG         = 0x6F;
static const uint8_t STRING_DATA             = 0x71;
static const uint8_t I2C_REQUEST             = 0x76;
static const uint8_t I2C_REPLY               = 0x77;
static const uint8_t I2C_CONFIG              = 0x78;
static const uint8_t REPORT_FIRMWARE         = 0x79;
static const uint8_t SERVO_CONFIG            = 0x70;
static const uint8_t SAMPLING_INTERVAL       = 0x7A;
static const uint8_t SCHEDULER_DATA          = 0x7B;

// Scheduler sub-commands (first payload byte after SCHEDULER_DATA)
static const uint8_t SCHED_CREATE          = 0x00;
static const uint8_t SCHED_DELETE          = 0x01;
static const uint8_t SCHED_ADD             = 0x02;
static const uint8_t SCHED_DELAY           = 0x03;
static const uint8_t SCHED_SCHEDULE        = 0x04;
static const uint8_t SCHED_QUERY_ALL       = 0x05;
static const uint8_t SCHED_QUERY           = 0x06;
static const uint8_t SCHED_RESET           = 0x07;
static const uint8_t SCHED_ERROR_REPLY     = 0x08;
static const uint8_t SCHED_QUERY_ALL_REPLY = 0x09;
static const uint8_t SCHED_QUERY_REPLY     = 0x0A;
static const uint8_t SCHED_EXT_HTTP_REPLY  = 0x0B;   // device -> host: HTTP status + body
static const uint8_t SCHED_REG_REPLY       = 0x0C;   // device -> host: R0-15 + F0-7 snapshot

/* --- Logic extension (see NONSTANDARD.md) -----------------------------------
   On-device registers + if/else so a stored task can make decisions by itself.
   Carried under the standard Scheduler's reserved extension command (0x7F,
   EXTENDED_SCHEDULER_COMMAND) so a base Firmata scheduler ignores it cleanly. */
static const uint8_t SCHED_EXT_COMMAND      = 0x7F;  // EXTENDED_SCHEDULER_COMMAND
static const uint8_t SCHED_EXT_SET          = 0x10;  // R[d] = const
static const uint8_t SCHED_EXT_READ_DIGITAL = 0x11;  // R[d] = digitalRead(pin)
static const uint8_t SCHED_EXT_READ_ANALOG  = 0x12;  // R[d] = analogRead(channel)
static const uint8_t SCHED_EXT_IF           = 0x13;  // if !(a op b) skip N bytes
static const uint8_t SCHED_EXT_SKIP         = 0x14;  // unconditional skip N bytes
static const uint8_t SCHED_EXT_HTTP         = 0x15;  // make an HTTP(S) request over Wi-Fi
// Response-inspection ops (operate on the last HTTP response body):
static const uint8_t SCHED_EXT_JSON_NUM         = 0x16;  // R[dst]=json number at path x10^scale; R[found]
static const uint8_t SCHED_EXT_JSON_STR_EQ      = 0x17;  // R[dst]=(json string at path == s)?1:0
static const uint8_t SCHED_EXT_BODY_CONTAINS    = 0x18;  // R[dst]=body contains s?1:0
static const uint8_t SCHED_EXT_JSON_STR_CONTAINS = 0x19; // R[dst]=(json string at path contains s)?1:0
static const uint8_t SCHED_EXT_ARITH         = 0x1A;  // R[dst] = A <op> B (int; op 0+ 1- 2* 3/ 4%)
static const uint8_t SCHED_EXT_SET_FLOAT     = 0x1B;  // F[dst] = float const (IEEE754 bits, 5 enc bytes)
static const uint8_t SCHED_EXT_ARITH_FLOAT   = 0x1C;  // F[dst] = A <op> B (float; op 0+ 1- 2* 3/)
static const uint8_t SCHED_EXT_JSON_FLOAT    = 0x1D;  // F[dst] = json float at path; R[found]
static const uint8_t SCHED_EXT_JSON_TYPE     = 0x1E;  // R[dst] = json type at path (0..6)
static const uint8_t SCHED_EXT_JSON_SIZE     = 0x1F;  // R[dst] = byte length of value span at path
static const uint8_t SCHED_EXT_STR_LEN       = 0x20;  // R[dst] = content length of json string at path
static const uint8_t SCHED_EXT_HEAP          = 0x21;  // R[freeReg]=free heap, R[largestReg]=largest block
static const uint8_t SCHED_EXT_REQUEST_COUNT = 0x22;  // R[dst] = current request count (generation)
static const uint8_t SCHED_EXT_SNAPSHOT      = 0x23;  // copy value at path from live body into a slot
static const uint8_t SCHED_EXT_SELECT        = 0x24;  // pick inspection source (0=live, k=snapshot k-1)
static const uint8_t SCHED_EXT_FREE          = 0x25;  // free a snapshot slot
static const uint8_t SCHED_EXT_LAST_STATUS   = 0x26;  // R[dst] = status of last inspection op
static const uint8_t SCHED_EXT_CMP           = 0x27;  // R[dst] = (A <op> B) ? 1 : 0
static const uint8_t SCHED_EXT_STR_BODY_LEN  = 0x28;  // R[dst] = byte length of the selected body
static const uint8_t SCHED_EXT_STR_EQUALS    = 0x29;  // R[dst] = (selected body == s) ? 1 : 0
static const uint8_t SCHED_EXT_STR_INDEXOF   = 0x2A;  // R[dst] = index of s in body, or -1
static const uint8_t SCHED_EXT_STR_TO_NUM    = 0x2B;  // R[dst] = body parsed as int; R[found] = 0/1
static const uint8_t SCHED_EXT_JSON_GET_STRING = 0x2C;  // copy a JSON string's content at path into a snapshot slot
static const uint8_t SCHED_EXT_STR_SET_SLOT    = 0x2D;  // set a snapshot slot's content to a literal string
static const uint8_t SCHED_EXT_STR_COPY_SLOT   = 0x2E;  // copy one snapshot slot's content into another
static const uint8_t SCHED_EXT_I2C_READ        = 0x2F;  // R[dst] = <count> bytes read from I2C addr/reg, big-endian
static const uint8_t SCHED_EXT_EMIT_STRING     = 0x30;  // device -> host: send a STRING_DATA frame to the master
static const uint8_t SCHED_EXT_REG_QUERY       = 0x31;  // report all registers to the host (SCHED_REG_REPLY)
static const uint8_t SCHED_EXT_WRITE_PIN       = 0x32;  // write a pin from an operand: kind(0=digital,1=analog) pin <operand>
static const uint8_t SCHED_EXT_MODULE_OP       = 0x33;  // deliver a payload to a module from a task
static const uint8_t SCHED_EXT_LOOP            = 0x34;  // begin a counted loop: countLo countHi gapLo gapHi skipLo skipHi
static const uint8_t SCHED_EXT_LOOP_END        = 0x35;  // end of a counted loop: decrement, jump back + gap, or exit
static const uint8_t SCHED_EXT_PWM_FREQ        = 0x36;  // set a PWM pin's frequency from an operand (runtime value)
static const uint8_t SCHED_EXT_DELAY_OP        = 0x37;  // delay milliseconds from an operand (runtime value)
static const uint8_t SCHED_EXT_ONCE            = 0x38;  // once-per-task-lifetime guard: idx, skip body when already run

// Result-status codes for inspection ops (read with SCHED_EXT_LAST_STATUS).
static const int32_t ST_OK            = 0;
static const int32_t ST_NOT_FOUND     = 1;
static const int32_t ST_STALE         = 2;
static const int32_t ST_TYPE_MISMATCH = 3;
static const int32_t ST_TOO_BIG       = 4;
static const int32_t ST_ALLOC_FAILED  = 5;

