doraorak/ESP32Firmata/ESP32Firmata.ino
/* --- Encrypted Wi-Fi provisioning over any transport (non-standard) ----------
   Top-level SysEx in Firmata's reserved user range (0x00-0x0F). Lets a client
   hand the board its Wi-Fi credentials — typically over BLE before Wi-Fi is up —
   via an ephemeral X25519 ECDH handshake (HKDF-SHA256 -> AES-256-GCM), so a
   passive sniffer never sees the password. Provisioned creds persist in NVS and
   override the compile-time WIFI_SSID/WIFI_PASS on the next boot. */
static const uint8_t MODULE_DATA       = 0x0D;  // module subsystem (user-range SysEx)
static const uint8_t PWM_CONFIG        = 0x0E;  // per-pin LEDC freq/resolution (user-range SysEx)
static const uint8_t TONE_CONFIG       = 0x0B;  // <pin> <freq:14b> <dur:14b>: tone on a .tone pin
static const uint8_t MODULE_QUERY      = 0x00;
static const uint8_t MODULE_LIST_REPLY = 0x7F;
static const uint8_t WIFI_CONFIG = 0x0C;
static const uint8_t WC_SET    = 0x00;  // host->dev: <clientPub><nonce><ct+tag>  (set + connect + save)
static const uint8_t WC_FORGET = 0x01;  // host->dev: clear stored creds
static const uint8_t WC_QUERY  = 0x02;  // host->dev: request current status
static const uint8_t WC_BEGIN  = 0x03;  // host->dev: start handshake (get device pubkey)
static const uint8_t WC_KEY    = 0x7E;  // dev->host: <devicePub>  (32 bytes, ephemeral)
static const uint8_t WC_STATUS = 0x7F;  // dev->host: <code> <ipLen> <ip>  (code 0=down 1=connected 2=rejected)
// Binary fields above are sent as 14-bit LSB/MSB pairs (lo = b&0x7F, hi = b>>7).

// Pin modes (Firmata §2)
static const uint8_t PIN_MODE_INPUT  = 0x00;
static const uint8_t PIN_MODE_OUTPUT = 0x01;
static const uint8_t PIN_MODE_ANALOG = 0x02;
static const uint8_t PIN_MODE_PWM    = 0x03;
static const uint8_t PIN_MODE_SERVO  = 0x04;
static const uint8_t PIN_MODE_I2C    = 0x06;
static const uint8_t PIN_MODE_PULLUP = 0x0B;
static const uint8_t PIN_MODE_TONE   = 0x0E;  // square-wave tone out (LEDC); write via TONE_CONFIG
// ESP32 extensions (block 0x10+, clear of the standard table)
static const uint8_t PIN_MODE_PULLDOWN = 0x10;  // internal pull-down (full-digital pins only)
static const uint8_t PIN_MODE_TOUCH    = 0x11;  // capacitive touch - reads via analog channels 6-15
static const uint8_t PIN_MODE_DAC      = 0x12;  // true 8-bit analog out (GPIO 25/26)

/* ==== ESP32 pin model =================================================== */
static const uint8_t TOTAL_PINS = 40;                 // GPIO 0..39
static const uint8_t NUM_PORTS  = (TOTAL_PINS + 7) / 8; // 5 ports

// ADC1 channels broken out on a typical ESP32 dev board -> analog channels A0..A5.
// (ADC2 pins are avoided: ADC2 cannot be read while Wi-Fi is active.)
static const int8_t  ANALOG_PINS[] = { 32, 33, 34, 35, 36, 39 };
static const uint8_t NUM_ANALOG    = sizeof(ANALOG_PINS) / sizeof(ANALOG_PINS[0]);

// Default I2C pins on the original ESP32.
static const uint8_t I2C_SDA_PIN = 21;
static const uint8_t I2C_SCL_PIN = 22;

/* ==== Types used in function signatures — must be declared before the first
    function so Arduino's auto-generated prototypes (inserted just above the
    first function) can see them.
   ==================== */
static const int SYSEX_MAX = 512;   // fits an HTTP op's URL + body in one SysEx

/* A firmware module: a class deriving from ModuleHandler, one instance per module
   (each in its own .ino). The base lives here because Arduino concatenates the
   main sketch first; the registry lives in ZRegistry.ino, which sorts last, so it
   sees every instance. Mirrors the Swift firmware's ModuleHandler protocol. */
struct ModuleHandler {
  virtual uint8_t id()    const = 0;
  virtual uint8_t major() const = 0;
  virtual uint8_t minor() const = 0;
  virtual const char *name() const = 0;
  virtual void handle(const uint8_t *payload, int length) = 0;
  virtual void tick() = 0;
  // Drop peripheral state on SYSTEM_RESET (which resets every pin to input, detaching an
  // RMT receiver from its pin) so the module re-arms on its next op. Default: nothing.
  virtual void reset() {}
  virtual ~ModuleHandler() {}
};

/* Firmata input-parser state. Two independent instances exist: one for the live
   host connection and one for replaying scheduler tasks — so a half-received
   live message can never be corrupted by task playback (and vice-versa). */
struct ParserState {
  bool    parsingSysex = false;
  int     waitForData = 0;
  uint8_t executeMultiByteCommand = 0;
  uint8_t multiByteChannel = 0;
  uint8_t storedInputData[2] = { 0, 0 };
  uint8_t sysexBuffer[SYSEX_MAX];
  int     sysexBytesRead = 0;
};

// Scheduler task storage.
static const uint8_t  MAX_TASKS      = 8;
static const uint16_t MAX_TASK_BYTES = 4096;
static const uint8_t  MAX_LOOP_DEPTH = 4;   // per-task counted-loop nesting (SCHED_EXT_LOOP)

struct SchedTask {
  bool     used = false;
  uint8_t  id = 0;
  uint32_t time_ms = 0;   // absolute millis() when due; 0 = not scheduled
  uint16_t len = 0;       // bytes of task data stored
  uint16_t pos = 0;       // execution cursor
  uint8_t  data[MAX_TASK_BYTES];
  // Counted-loop stack (SCHED_EXT_LOOP / _END): iterations left, gap ms, and the byte
  // position to jump back to for each open loop. Persists across delay-suspends.
  uint8_t  loopDepth = 0;
  uint16_t loopRemaining[MAX_LOOP_DEPTH] = {0};
  uint32_t loopGap[MAX_LOOP_DEPTH]       = {0};
  uint16_t loopResume[MAX_LOOP_DEPTH]    = {0};
  // once{} guards taken this task lifetime (bit = ONCE idx). Cleared on (re)schedule
  // only — NOT on the trailing-delay wraparound.
  uint32_t onceMask = 0;
};

// Full digital pins: support INPUT / INPUT_PULLUP / OUTPUT / PWM.
static bool isFullDigital(uint8_t pin) {
  switch (pin) {
    case 0:  case 2:  case 4:  case 5:
    case 12: case 13: case 14: case 15:
    case 16: case 17: case 18: case 19:
    case 21: case 22: case 23:
    case 25: case 26: case 27:
    case 32: case 33:
      return true;
    default:
      return false;
  }
}

// Input-only pins: INPUT (no output, no PWM, no internal pull-up).
static bool isInputOnly(uint8_t pin) {
  return pin == 34 || pin == 35 || pin == 36 || pin == 39;
}

static bool isUsable(uint8_t pin) {
  return isFullDigital(pin) || isInputOnly(pin);
}

// Analog channel for a pin, or -1 if the pin is not analog-capable.
static int analogChannelOfPin(uint8_t pin) {
  for (uint8_t i = 0; i < NUM_ANALOG; i++)
    if (ANALOG_PINS[i] == (int8_t)pin) return i;
  return -1;
}

