doraorak/ESP32Firmata/ESP32Firmata.ino
static int pinOfAnalogChannel(uint8_t ch) {
  return (ch < NUM_ANALOG) ? ANALOG_PINS[ch] : -1;
}

// Touch sensors T0-T9 ride the analog paths on channels 6-15 (ADC owns 0-5).
static const int8_t  TOUCH_PINS[] = { 4, 0, 2, 15, 13, 12, 14, 27, 33, 32 };   // T0..T9
static const uint8_t TOUCH_CHANNEL_BASE = 6;
static int touchSensorOfPin(uint8_t pin) {
  for (uint8_t i = 0; i < 10; i++) if (TOUCH_PINS[i] == (int8_t)pin) return i;
  return -1;
}
static int pinOfTouchChannel(uint8_t ch) {
  int t = (int)ch - TOUCH_CHANNEL_BASE;
  return (t >= 0 && t < 10) ? TOUCH_PINS[t] : -1;
}
static bool isDACPin(uint8_t pin) { return pin == 25 || pin == 26; }

/* ==== Runtime pin / reporting state ===================================== */
static uint8_t  pinModes[TOTAL_PINS];   // current Firmata mode per pin
static int      pinValues[TOTAL_PINS];  // last written output / PWM value
static bool     pinConfigured[TOTAL_PINS]; // host explicitly set a digital mode
static uint16_t analogReportMask = 0;   // bit c = report analog channel c
static bool     reportPort[NUM_PORTS];  // digital input reporting per port
static uint8_t  previousPort[NUM_PORTS];// last reported digital port mask
static int      pwmMaxDuty[TOTAL_PINS]; // (1 << resBits) - 1; default 8-bit, PWM_CONFIG overrides

/* PWM_CONFIG pins bypass the Arduino core's LEDC layer (its analogWrite-family
   retune paths proved flaky on rapid frequency changes — melody notes died
   nondeterministically). Each configured pin gets an IDF-direct LOW-SPEED
   timer+channel, allocated from the TOP so the core's own bottom-up allocation
   (servo, plain PWM analogWrite) never collides. Retune = ledc_set_freq only. */
#include "driver/ledc.h"
#define FM_LEDC_SLOTS 4
static int fmLedcPin[FM_LEDC_SLOTS] = { -1, -1, -1, -1 };
static int fmLedcRes[FM_LEDC_SLOTS] = { 8, 8, 8, 8 };
static int fmLedcSlotOf(int pin) {
  for (int i = 0; i < FM_LEDC_SLOTS; i++) if (fmLedcPin[i] == pin) return i;
  return -1;
}
static void fmLedcTimerInit(int slot, uint32_t freq, int res) {
  ledc_timer_config_t t = {};
  t.speed_mode      = LEDC_LOW_SPEED_MODE;
  t.duty_resolution = (ledc_timer_bit_t)res;
  t.timer_num       = (ledc_timer_t)(3 - slot);
  t.freq_hz         = freq;
  t.clk_cfg         = LEDC_AUTO_CLK;
  ledc_timer_config(&t);
}
// Duty write routing: PWM_CONFIG pins -> their IDF channel; others -> analogWrite.
static void fmPwmWrite(uint8_t pin, int duty) {
  int slot = fmLedcSlotOf(pin);
  if (slot >= 0) {
    // duty == max -> write max+1: LEDC's constant-high point (true 100%, no spike train)
    uint32_t d = (uint32_t)duty;
    uint32_t max = (1u << fmLedcRes[slot]) - 1u;
    if (d >= max) d = max + 1u;
    ledc_set_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)(7 - slot), d);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)(7 - slot));
  } else {
    analogWrite(pin, duty);
  }
}

/* ==== Tone (.tone pin): auto-stop timers for TONE_CONFIG durations (0 = no timer).
   toneTimersActive lets the tick skip the scan when none are pending. ==== */
static uint32_t toneOffMs[TOTAL_PINS] = {0};
static int toneTimersActive = 0;
static void fmSetToneTimer(uint8_t pin, uint32_t durMs) {
  if (toneOffMs[pin] == 0) toneTimersActive++;
  uint32_t off = millis() + durMs;
  if (off == 0) off = 1;                 // 0 is the "no timer" sentinel
  toneOffMs[pin] = off;
}
static void fmClearToneTimer(uint8_t pin) {
  if (toneOffMs[pin] != 0) { toneTimersActive--; toneOffMs[pin] = 0; }
}
static void toneTick() {
  if (toneTimersActive == 0) return;
  uint32_t now = millis();
  for (uint8_t pin = 0; pin < TOTAL_PINS; pin++) {
    if (toneOffMs[pin] != 0 && (int32_t)(now - toneOffMs[pin]) >= 0) {
      fmPwmWrite(pin, 0); pinValues[pin] = 0; fmClearToneTimer(pin);
    }
  }
}

static uint16_t samplingInterval = 19;  // ms (Firmata default)
static const uint16_t MIN_SAMPLING = 10;
static unsigned long  lastSampleMs = 0;

// I2C
static uint16_t i2cReadDelayUs = 0;
struct ContinuousRead { uint16_t address; int reg; uint16_t count; bool active; };
static const uint8_t MAX_CONT_READS = 8;
static ContinuousRead contReads[MAX_CONT_READS];

/* Non-standard scheduler registers: 16 global Int32s shared across tasks.
   (The Scheduler and FirmataProtocol classes, and their instances, are defined
    further down — after the send helpers they depend on.) */
static const uint8_t NUM_SCHED_REGS = 32;
static const uint8_t NUM_FLOAT_REGS = 16;     // F0..F7 (logic extension)
static const int     NUM_SNAP       = 12;    // 2 JSON snapshot slots (0–1) + 10 string slots (2–11)

// Scratch buffer used to build outgoing frames.
/* Servo pulse range per pin (SERVO_CONFIG overrides the 544-2400 us defaults). */
static int32_t servoMinUs[40];
static int32_t servoMaxUs[40];

static uint8_t   frameBuf[5120];   // holds a full 4096-byte task 8/7-encoded (queryTask reply)
// Max response bytes retained for JSON/string inspection AND echoed to a host.
static const int HTTP_PARSE_MAX = 4096;

/* ==== Dual-transport master arbitration (latest-wins)
   Exactly one transport "owns" the board at a time. A new connection on either
   transport calls claimMaster(), which evicts the other transport's holder.
   ==================== */
enum ActiveTransport : uint8_t { TR_NONE = 0, TR_TCP, TR_BLE, TR_SERIAL };
static ActiveTransport activeTransport = TR_NONE;

/* Console logging is gated: once a host starts speaking Firmata over USB serial,
   log lines would corrupt the binary stream, so the serial claim silences both
   our own prints and the IDF runtime logs for the rest of the session. */
static bool consoleQuiet = false;
#define LOGP(...)  do { if (!consoleQuiet) Serial.print(__VA_ARGS__);   } while (0)
#define LOGLN(...) do { if (!consoleQuiet) Serial.println(__VA_ARGS__); } while (0)
#define LOGF(...)  do { if (!consoleQuiet) Serial.printf(__VA_ARGS__);  } while (0)

/* ==== Forward declarations ============================================== */
static void transportInit();
static void transportPoll();
static void serialPoll();
static void sendFrame(const uint8_t *buf, size_t len);
static bool transportConnected();
static void onNewConnection();
static void claimMaster(ActiveTransport who);
#if ENABLE_WIFI
static void tcpDrop();
static void tcpSend(const uint8_t *buf, size_t len);
#endif
#if ENABLE_BLE
static void bleDrop();
static void bleSend(const uint8_t *buf, size_t len);
#endif

static void systemResetState();

// The Firmata protocol handler and the Scheduler are classes (see below); they
// reference each other, so forward-declare both here.
class Scheduler;
class FirmataProtocol;

// PWM uses the Arduino core's analogWrite() (ESP32 core 3.x: LEDC-backed,
// 8-bit). Firmata duty is 0..255, so callers clamp before writing.

/* ==== Outgoing Firmata messages ========================================= */
static void sendProtocolVersion() {
  uint8_t b[3] = { REPORT_VERSION, PROTOCOL_MAJOR, PROTOCOL_MINOR };
  sendFrame(b, 3);
}

