doraorak/ESP32Firmata/ESP32Firmata.ino
static void sendFirmwareReport() {
  int n = 0;
  frameBuf[n++] = START_SYSEX;
  frameBuf[n++] = REPORT_FIRMWARE;
  frameBuf[n++] = FIRMWARE_MAJOR;
  frameBuf[n++] = FIRMWARE_MINOR;
  const char *name = FIRMWARE_NAME;
  for (const char *p = name; *p; ++p) {
    frameBuf[n++] = (uint8_t)(*p) & 0x7F;
    frameBuf[n++] = ((uint8_t)(*p) >> 7) & 0x7F;
  }
  frameBuf[n++] = END_SYSEX;
  sendFrame(frameBuf, n);
}

static void sendCapabilityResponse() {
  int n = 0;
  frameBuf[n++] = START_SYSEX;
  frameBuf[n++] = CAPABILITY_RESPONSE;
  for (uint8_t pin = 0; pin < TOTAL_PINS; pin++) {
    if (isFullDigital(pin)) {
      frameBuf[n++] = PIN_MODE_INPUT;  frameBuf[n++] = 1;
      frameBuf[n++] = PIN_MODE_PULLUP; frameBuf[n++] = 1;
      frameBuf[n++] = PIN_MODE_PULLDOWN; frameBuf[n++] = 1;
      frameBuf[n++] = PIN_MODE_OUTPUT; frameBuf[n++] = 1;
      frameBuf[n++] = PIN_MODE_PWM;    frameBuf[n++] = 14;  // up to 14-bit via PWM_CONFIG
      frameBuf[n++] = PIN_MODE_SERVO;  frameBuf[n++] = 14;
      if (pin == I2C_SDA_PIN || pin == I2C_SCL_PIN) {
        frameBuf[n++] = PIN_MODE_I2C;  frameBuf[n++] = 1;
      }
      if (analogChannelOfPin(pin) >= 0) {
        frameBuf[n++] = PIN_MODE_ANALOG; frameBuf[n++] = 12;
      }
      if (touchSensorOfPin(pin) >= 0) {
        frameBuf[n++] = PIN_MODE_TOUCH; frameBuf[n++] = 14;
      }
      if (isDACPin(pin)) {
        frameBuf[n++] = PIN_MODE_DAC; frameBuf[n++] = 8;
      }
    } else if (isInputOnly(pin)) {
      frameBuf[n++] = PIN_MODE_INPUT; frameBuf[n++] = 1;
      if (analogChannelOfPin(pin) >= 0) {
        frameBuf[n++] = PIN_MODE_ANALOG; frameBuf[n++] = 12;
      }
    }
    frameBuf[n++] = 0x7F;  // end of this pin's capabilities
  }
  frameBuf[n++] = END_SYSEX;
  sendFrame(frameBuf, n);
}

static void sendAnalogMappingResponse() {
  int n = 0;
  frameBuf[n++] = START_SYSEX;
  frameBuf[n++] = ANALOG_MAPPING_RESPONSE;
  for (uint8_t pin = 0; pin < TOTAL_PINS; pin++) {
    int ch = analogChannelOfPin(pin);
    // Touch pins with no ADC channel report their touch channel (6-15) so the host
    // can read them via analogRead(channel:) / touchRead(pin:).
    if (ch < 0 && touchSensorOfPin(pin) >= 0) ch = TOUCH_CHANNEL_BASE + touchSensorOfPin(pin);
    frameBuf[n++] = (ch >= 0) ? (uint8_t)ch : 0x7F;
  }
  frameBuf[n++] = END_SYSEX;
  sendFrame(frameBuf, n);
}

static void sendPinStateResponse(uint8_t pin) {
  if (pin >= TOTAL_PINS) return;
  int n = 0;
  frameBuf[n++] = START_SYSEX;
  frameBuf[n++] = PIN_STATE_RESPONSE;
  frameBuf[n++] = pin;
  frameBuf[n++] = pinModes[pin];
  // value as little-endian 7-bit groups (always at least one byte)
  uint32_t v = (uint32_t)pinValues[pin];
  frameBuf[n++] = v & 0x7F;
  v >>= 7;
  while (v) { frameBuf[n++] = v & 0x7F; v >>= 7; }
  frameBuf[n++] = END_SYSEX;
  sendFrame(frameBuf, n);
}

static void sendAnalogReport(uint8_t channel, int value) {
  uint8_t b[3];
  b[0] = ANALOG_MESSAGE | (channel & 0x0F);
  b[1] = value & 0x7F;
  b[2] = (value >> 7) & 0x7F;
  sendFrame(b, 3);
}

static void sendDigitalPort(uint8_t port, uint8_t mask) {
  uint8_t b[3];
  b[0] = DIGITAL_MESSAGE | (port & 0x0F);
  b[1] = mask & 0x7F;
  b[2] = (mask >> 7) & 0x01;
  sendFrame(b, 3);
}

static void sendI2CReply(uint16_t address, int reg, const uint8_t *data, int count) {
  int n = 0;
  frameBuf[n++] = START_SYSEX;
  frameBuf[n++] = I2C_REPLY;
  frameBuf[n++] = address & 0x7F;
  frameBuf[n++] = (address >> 7) & 0x7F;
  uint16_t r = (reg < 0) ? 0 : (uint16_t)reg;
  frameBuf[n++] = r & 0x7F;
  frameBuf[n++] = (r >> 7) & 0x7F;
  for (int i = 0; i < count; i++) {
    frameBuf[n++] = data[i] & 0x7F;
    frameBuf[n++] = (data[i] >> 7) & 0x7F;
  }
  frameBuf[n++] = END_SYSEX;
  sendFrame(frameBuf, n);
}

/* ==== Pin I/O handlers
   I2C device helpers (global; shared by the live handler and periodic sampling).
   ==================== */
static void i2cDoRead(uint16_t address, int reg, uint16_t count) {
  if (reg >= 0) {
    Wire.beginTransmission(address);
    Wire.write((uint8_t)reg);
    Wire.endTransmission();
  }
  if (i2cReadDelayUs) delayMicroseconds(i2cReadDelayUs);

  static uint8_t buf[64];
  if (count > sizeof(buf)) count = sizeof(buf);
  int got = Wire.requestFrom((int)address, (int)count);
  int i = 0;
  while (Wire.available() && i < got && i < (int)count) buf[i++] = Wire.read();
  sendI2CReply(address, reg, buf, i);
}

static void addContinuousRead(uint16_t address, int reg, uint16_t count) {
  for (uint8_t i = 0; i < MAX_CONT_READS; i++) {
    if (contReads[i].active && contReads[i].address == address) {
      contReads[i].reg = reg; contReads[i].count = count; return;
    }
  }
  for (uint8_t i = 0; i < MAX_CONT_READS; i++) {
    if (!contReads[i].active) {
      contReads[i] = { address, reg, count, true }; return;
    }
  }
}

static void stopContinuousRead(uint16_t address) {
  for (uint8_t i = 0; i < MAX_CONT_READS; i++)
    if (contReads[i].active && contReads[i].address == address) contReads[i].active = false;
}

/* ==== Live protocol handler
    Parses an incoming Firmata byte stream (its own ParserState) and applies
    each command. One instance drives the live transport; a second drives
    scheduler task replay. Both act on shared device state and route scheduler
    SysEx to the shared Scheduler.
   ==================== */
class FirmataProtocol {
 public:
  ParserState ps;
  Scheduler*  sched = nullptr;        // wired once at startup (see setup)

  /* Servo value semantics (standard Firmata): < 544 is an angle in degrees
     (0-180 mapped onto the pin's pulse range); >= 544 is a raw pulse width in us.
     LEDC at 50 Hz / 14-bit: duty = us * 2^14 / 20000. */
  void servoOut(uint8_t pin, int value) {
    int32_t us;
    if (value < 544) {
      int32_t a = value < 0 ? 0 : (value > 180 ? 180 : value);
      us = servoMinUs[pin] + (servoMaxUs[pin] - servoMinUs[pin]) * a / 180;
    } else {
      us = value;
      if (us < servoMinUs[pin]) us = servoMinUs[pin];
      if (us > servoMaxUs[pin]) us = servoMaxUs[pin];
    }
    uint32_t duty = (uint32_t)((uint64_t)us * 16384u / 20000u);
    if (duty > 16383u) duty = 16383u;
    ledcWrite(pin, duty);
    pinValues[pin] = us;
  }

