doraorak/ESP32Firmata/ESP32Firmata.ino
  /* True analog out (8-bit DAC, GPIO 25/26). */
  void dacOut(uint8_t pin, int value) {
    int v = value < 0 ? 0 : (value > 255 ? 255 : value);
    dacWrite(pin, (uint8_t)v);
    pinValues[pin] = v;
  }

  void handleSetPinMode(uint8_t pin, uint8_t mode) {
    if (pin >= TOTAL_PINS) return;
    if (pinModes[pin] == PIN_MODE_SERVO && mode != PIN_MODE_SERVO) ledcDetach(pin);
    if (pinModes[pin] == PIN_MODE_TONE  && mode != PIN_MODE_TONE)  { fmPwmWrite(pin, 0); fmClearToneTimer(pin); }
    switch (mode) {
      case PIN_MODE_INPUT:
        if (isUsable(pin)) { pinMode(pin, INPUT); pinModes[pin] = mode; pinConfigured[pin] = true; }
        break;
      case PIN_MODE_PULLUP:
        if (isFullDigital(pin)) { pinMode(pin, INPUT_PULLUP); pinModes[pin] = mode; pinValues[pin] = 1; pinConfigured[pin] = true; }
        break;
      case PIN_MODE_OUTPUT:
        if (isFullDigital(pin)) { pinMode(pin, OUTPUT); pinModes[pin] = mode; pinConfigured[pin] = true; }
        break;
      case PIN_MODE_ANALOG:
        if (analogChannelOfPin(pin) >= 0) { pinModes[pin] = mode; }
        break;
      case PIN_MODE_PWM:
        if (isFullDigital(pin)) { pinModes[pin] = mode; analogWrite(pin, 0); pinValues[pin] = 0; }
        break;
      case PIN_MODE_SERVO:
        if (isFullDigital(pin)) {
          ledcAttach(pin, 50, 14);
          pinModes[pin] = mode; pinValues[pin] = 0; pinConfigured[pin] = true;
        }
        break;
      case PIN_MODE_I2C:
        pinModes[pin] = mode;
        break;
      case PIN_MODE_PULLDOWN:
        // Internal pull-down - full-digital pins only (GPIO 34-39 have no pull resistors).
        if (isFullDigital(pin)) { pinMode(pin, INPUT_PULLDOWN); pinModes[pin] = mode; pinValues[pin] = 0; pinConfigured[pin] = true; }
        break;
      case PIN_MODE_TOUCH:
        // Capacitive touch - the sensor then reads via its analog channel (6-15), like ANALOG.
        if (touchSensorOfPin(pin) >= 0) { pinModes[pin] = mode; }
        break;
      case PIN_MODE_DAC:
        if (isDACPin(pin)) { pinModes[pin] = mode; dacOut(pin, 0); }
        break;
      case PIN_MODE_TONE:
        if (isFullDigital(pin)) { pinModes[pin] = mode; pwmMaxDuty[pin] = 255; pinValues[pin] = 0; pinConfigured[pin] = true; }
        break;
      default:
        break;
    }
  }

  /* SERVO_CONFIG (0x70): pin, minPulse (14-bit LE), maxPulse (14-bit LE). Sets the
     pulse range and puts the pin in servo mode (standard Firmata behaviour). */
  void handleServoConfig(const uint8_t *data, int len) {
    if (len < 5) return;
    uint8_t pin = data[0];
    if (pin >= TOTAL_PINS || !isFullDigital(pin)) return;
    int32_t mn = (int32_t)(data[1] & 0x7F) | ((int32_t)(data[2] & 0x7F) << 7);
    int32_t mx = (int32_t)(data[3] & 0x7F) | ((int32_t)(data[4] & 0x7F) << 7);
    if (mn > 0 && mx > mn) { servoMinUs[pin] = mn; servoMaxUs[pin] = mx; }
    handleSetPinMode(pin, PIN_MODE_SERVO);
  }

  /* Configure a pin's LEDC timer+channel at `freq`/`res` bits (shared by PWM_CONFIG and
     tone). Claims one of the 4 IDF low-speed slots; retunes in place on later calls. */
  void ledcConfigure(uint8_t pin, uint32_t freq, int res) {
    int slot = fmLedcSlotOf(pin);
    if (slot < 0) {                                    // first config: claim a slot
      for (int i = 0; i < FM_LEDC_SLOTS; i++) if (fmLedcPin[i] < 0) { slot = i; break; }
      if (slot < 0) return;                            // all 4 slots busy
      fmLedcPin[slot] = pin;
      fmLedcRes[slot] = res;
      fmLedcTimerInit(slot, freq, res);
      ledc_channel_config_t c = {};
      c.gpio_num   = pin;
      c.speed_mode = LEDC_LOW_SPEED_MODE;
      c.channel    = (ledc_channel_t)(7 - slot);
      c.intr_type  = LEDC_INTR_DISABLE;
      c.timer_sel  = (ledc_timer_t)(3 - slot);
      c.duty       = 0;
      c.hpoint     = 0;
      ledc_channel_config(&c);
    } else if (res != fmLedcRes[slot]) {               // resolution change: re-init timer
      fmLedcRes[slot] = res;
      fmLedcTimerInit(slot, freq, res);
    } else {                                           // retune only — deterministic
      ledc_set_freq(LEDC_LOW_SPEED_MODE, (ledc_timer_t)(3 - slot), freq);
    }
    pwmMaxDuty[pin] = (1 << res) - 1;
  }

  /* Tone out (.tone pin): a 50%-duty LEDC square wave at `hz` (0 = silence). */
  void toneOut(uint8_t pin, int hz) {
    if (hz > 0) { ledcConfigure(pin, (uint32_t)hz, 8); fmPwmWrite(pin, 128); }
    else        { fmPwmWrite(pin, 0); }
    pinValues[pin] = hz;
  }

  /* PWM_CONFIG (0x0E): pin, frequency Hz (3 x 7-bit LE, up to ~2 MHz), duty resolution
     in bits (1-14). Applies the LEDC config and puts the pin in PWM mode (mirrors
     SERVO_CONFIG's set-the-mode behaviour). On a passive buzzer the frequency IS the tone. */
  void handlePwmConfig(const uint8_t *data, int len) {
    if (len < 5) return;
    uint8_t pin = data[0];
    if (pin >= TOTAL_PINS || !isFullDigital(pin)) return;
    int32_t freq = (int32_t)(data[1] & 0x7F) | ((int32_t)(data[2] & 0x7F) << 7) | ((int32_t)(data[3] & 0x7F) << 14);
    int res = data[4] & 0x7F;
    if (res < 1) res = 1;
    if (res > 14) res = 14;
    if (freq <= 0) return;
    ledcConfigure(pin, (uint32_t)freq, res);
    pinModes[pin] = PIN_MODE_PWM;
    pinValues[pin] = 0;
    pinConfigured[pin] = true;
  }

  /* TONE_CONFIG (0x0B): <pin> <freq:14-bit LE> <dur:14-bit LE>. Plays a square wave at
     `freq` on a .tone pin (mode-gated); `dur` ms auto-stops via the tone timers, dur 0
     is continuous, freq 0 stops. */
  void handleTone(const uint8_t *data, int len) {
    if (len < 5) return;
    uint8_t pin = data[0];
    if (pin >= TOTAL_PINS || pinModes[pin] != PIN_MODE_TONE) return;
    int hz = (int)(data[1] & 0x7F) | ((int)(data[2] & 0x7F) << 7);
    uint32_t dur = (uint32_t)(data[3] & 0x7F) | ((uint32_t)(data[4] & 0x7F) << 7);
    toneOut(pin, hz);
    if (hz > 0 && dur > 0) fmSetToneTimer(pin, dur); else fmClearToneTimer(pin);
  }

  void handleSetDigitalPinValue(uint8_t pin, uint8_t value) {
    if (pin >= TOTAL_PINS) return;
    if (pinModes[pin] == PIN_MODE_OUTPUT) {
      digitalWrite(pin, value ? HIGH : LOW);
      pinValues[pin] = value ? 1 : 0;
    }
  }

  // Write a whole 8-pin port; only OUTPUT pins are affected.
  void handleDigitalMessage(uint8_t port, uint8_t lsb, uint8_t msb) {
    uint8_t portValue = (lsb & 0x7F) | ((msb & 0x01) << 7);
    for (int i = 0; i < 8; i++) {
      uint8_t pin = port * 8 + i;
      if (pin >= TOTAL_PINS) break;
      if (pinModes[pin] == PIN_MODE_OUTPUT) {
        uint8_t bit = (portValue >> i) & 0x01;
        digitalWrite(pin, bit ? HIGH : LOW);
        pinValues[pin] = bit;
      }
    }
  }

  // ANALOG_MESSAGE (host -> device) is a PWM write; the channel nibble is the pin.
  void handleAnalogMessage(uint8_t pin, uint8_t lsb, uint8_t msb) {
    if (pin >= TOTAL_PINS) return;
    int value = (lsb & 0x7F) | ((msb & 0x7F) << 7);
    if (pinModes[pin] == PIN_MODE_PWM) {
      int hi = pwmMaxDuty[pin];
      fmPwmWrite(pin, value > hi ? hi : (value < 0 ? 0 : value));
      pinValues[pin] = value;
    } else if (pinModes[pin] == PIN_MODE_SERVO) {
      servoOut(pin, value);
    } else if (pinModes[pin] == PIN_MODE_DAC) {
      dacOut(pin, value);
    }
  }

  void handleReportAnalog(uint8_t channel, uint8_t enable) {
    if (channel > 15) return;
    if (enable) analogReportMask |=  (1 << channel);
    else        analogReportMask &= ~(1 << channel);
  }

