doraorak/ESP32Firmata/ESP32Firmata.ino
  void handleReportDigital(uint8_t port, uint8_t enable) {
    if (port >= NUM_PORTS) return;
    reportPort[port] = (enable != 0);
    if (reportPort[port]) {
      // Send current state immediately so the host has an initial value.
      uint8_t mask = 0;
      for (int i = 0; i < 8; i++) {
        uint8_t pin = port * 8 + i;
        if (pin >= TOTAL_PINS) break;
        if (!isUsable(pin) || !pinConfigured[pin]) continue;  // skip floating, unconfigured pins
        uint8_t m = pinModes[pin];
        if (m == PIN_MODE_INPUT || m == PIN_MODE_PULLUP) {
          if (digitalRead(pin)) mask |= (1 << i);
        } else if (m == PIN_MODE_OUTPUT) {
          if (pinValues[pin]) mask |= (1 << i);
        }
      }
      previousPort[port] = mask;
      sendDigitalPort(port, mask);
    }
  }

  void handleExtendedAnalog(const uint8_t *data, int len) {
    if (len < 1) return;
    uint8_t pin = data[0];
    if (pin >= TOTAL_PINS) return;
    int value = 0;
    for (int i = 1; i < len; i++) value |= (int)(data[i] & 0x7F) << (7 * (i - 1));
    if (pinModes[pin] == PIN_MODE_PWM) {
      int hi = pwmMaxDuty[pin];
      fmPwmWrite(pin, value > hi ? hi : (value < 0 ? 0 : value));
      pinValues[pin] = value;
    } else if (pinModes[pin] == PIN_MODE_SERVO) {
      servoOut(pin, value);
    } else if (pinModes[pin] == PIN_MODE_DAC) {
      dacOut(pin, value);
    }
  }

  void handleI2CConfig(const uint8_t *data, int len) {
    Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
    if (len >= 2) i2cReadDelayUs = (data[0] & 0x7F) | ((data[1] & 0x7F) << 7);
  }

  void handleI2CRequest(const uint8_t *data, int len) {
    if (len < 2) return;
    uint16_t address = data[0] & 0x7F;
    uint8_t  control = data[1];
    uint8_t  mode    = (control >> 3) & 0x03;
    bool     tenbit  = control & 0x20;
    if (tenbit) address |= (uint16_t)(control & 0x07) << 7;

    const uint8_t *payload = data + 2;
    int plen = len - 2;

    switch (mode) {
      case 0: {  // WRITE
        Wire.beginTransmission(address);
        for (int i = 0; i + 1 < plen; i += 2) {
          uint8_t b = (payload[i] & 0x7F) | ((payload[i + 1] & 0x7F) << 7);
          Wire.write(b);
        }
        bool restart = control & 0x40;
        Wire.endTransmission(!restart);  // restart -> no STOP
        break;
      }
      case 1: {  // READ_ONCE
        int reg = -1; uint16_t count = 0;
        if (plen >= 4) {        // register + count both present
          reg   = (payload[0] & 0x7F) | ((payload[1] & 0x7F) << 7);
          count = (payload[2] & 0x7F) | ((payload[3] & 0x7F) << 7);
        } else if (plen >= 2) { // count only
          count = (payload[0] & 0x7F) | ((payload[1] & 0x7F) << 7);
        }
        i2cDoRead(address, reg, count);
        break;
      }
      case 2: {  // READ_CONTINUOUS
        int reg = -1; uint16_t count = 0;
        if (plen >= 4) {
          reg   = (payload[0] & 0x7F) | ((payload[1] & 0x7F) << 7);
          count = (payload[2] & 0x7F) | ((payload[3] & 0x7F) << 7);
        } else if (plen >= 2) {
          count = (payload[0] & 0x7F) | ((payload[1] & 0x7F) << 7);
        }
        addContinuousRead(address, reg, count);
        break;
      }
      case 3:    // STOP_READING
        stopContinuousRead(address);
        break;
    }
  }

  void handleString(const uint8_t *data, int len) {
    String s;
    for (int i = 0; i + 1 < len; i += 2) {
      uint16_t cp = (data[i] & 0x7F) | ((data[i + 1] & 0x7F) << 7);
      if (cp < 128) s += (char)cp;
    }
    LOGP("[host] "); LOGLN(s);
  }

  void processSysex(const uint8_t *buf, int len);   // defined after Scheduler

  // Firmata input byte state machine; mutates this handler's own ParserState.
  void process(uint8_t inputData) {
    ParserState &ps = this->ps;
    if (ps.parsingSysex) {
      if (inputData == END_SYSEX) {
        ps.parsingSysex = false;
        processSysex(ps.sysexBuffer, ps.sysexBytesRead);
      } else if (ps.sysexBytesRead < SYSEX_MAX) {
        ps.sysexBuffer[ps.sysexBytesRead++] = inputData;
      }
      return;
    }

    if (ps.waitForData > 0 && inputData < 0x80) {
      ps.waitForData--;
      ps.storedInputData[ps.waitForData] = inputData;   // [1]=first byte, [0]=second byte
      if (ps.waitForData == 0 && ps.executeMultiByteCommand != 0) {
        switch (ps.executeMultiByteCommand) {
          case ANALOG_MESSAGE:
            handleAnalogMessage(ps.multiByteChannel, ps.storedInputData[1], ps.storedInputData[0]);
            break;
          case DIGITAL_MESSAGE:
            handleDigitalMessage(ps.multiByteChannel, ps.storedInputData[1], ps.storedInputData[0]);
            break;
          case SET_PIN_MODE:
            handleSetPinMode(ps.storedInputData[1], ps.storedInputData[0]);
            break;
          case SET_DIGITAL_PIN_VALUE:
            handleSetDigitalPinValue(ps.storedInputData[1], ps.storedInputData[0]);
            break;
          case REPORT_ANALOG:
            handleReportAnalog(ps.multiByteChannel, ps.storedInputData[0]);
            break;
          case REPORT_DIGITAL:
            handleReportDigital(ps.multiByteChannel, ps.storedInputData[0]);
            break;
        }
        ps.executeMultiByteCommand = 0;
      }
      return;
    }

    // New command byte.
    uint8_t command;
    if (inputData < 0xF0) {
      command             = inputData & 0xF0;
      ps.multiByteChannel = inputData & 0x0F;
    } else {
      command = inputData;
    }

    switch (command) {
      case ANALOG_MESSAGE:
      case DIGITAL_MESSAGE:
      case SET_PIN_MODE:
      case SET_DIGITAL_PIN_VALUE:
        ps.waitForData = 2; ps.executeMultiByteCommand = command; break;
      case REPORT_ANALOG:
      case REPORT_DIGITAL:
        ps.waitForData = 1; ps.executeMultiByteCommand = command; break;
      case START_SYSEX:
        ps.parsingSysex = true; ps.sysexBytesRead = 0; break;
      case SYSTEM_RESET:
        systemResetState(); break;
      case REPORT_VERSION:
        sendProtocolVersion(); break;
      default:
        break;  // ignore unknown command bytes
    }
  }
};

/* ==== Firmata Scheduler (SysEx 0x7B) — class
    Stores tasks (recorded Firmata messages + delays) and replays them — through
    a dedicated FirmataProtocol instance (`replay`) — even with no host
    connected. Also owns the non-standard logic extension: 16 Int32 registers,
    if/else, and internet actions. Encoder7Bit helpers live here as methods.
    Wire format follows the official Firmata Scheduler protocol.
   ==================== */
class Scheduler {
 public:
  SchedTask        tasks[MAX_TASKS];
  SchedTask       *running = nullptr;
  int32_t          regs[NUM_SCHED_REGS];
  float            fregs[NUM_FLOAT_REGS] = {0};   // F0..F7 (logic extension)
  FirmataProtocol *replay = nullptr;     // wired once at startup (see setup)
  String           httpRespBody;         // last HTTP response (until next request)

  // Response-inspection state (snapshots + staleness, mirrors the Swift firmware).
  int32_t  requestCount = 0;             // ++ on each HTTP request; basis for handle staleness
  int      inspectSel   = 0;             // inspection source: 0 = live body, k = snapshot slot k-1
  bool     inspectStale = false;         // borrowed live source selected after a newer request
  int32_t  lastStatus   = ST_OK;         // result-status of the last inspection op
  uint8_t *snapBuf[NUM_SNAP] = { nullptr, nullptr };   // owned snapshot copies
  int      snapLen[NUM_SNAP] = { 0, 0 };

  // An operand carries both an int and a float view; `isFloat` says which is
  // authoritative (so a comparison/op promotes to float when either side is float).
  struct Operand { bool isFloat; int32_t i; float f; };

  // Trap-free Float -> Int32 (NaN -> 0, overflow clamps).
  static int32_t f2i(float x) {
    if (x != x) return 0;                          // NaN
    if (x >=  2147483520.0f) return INT32_MAX;
    if (x <= -2147483520.0f) return INT32_MIN;
    return (int32_t)x;
  }
  // Reinterpret 32 raw bits as a Float (IEEE754) without aliasing UB.
  static float bitsToFloat(uint32_t b) { union { uint32_t u; float f; } x; x.u = b; return x.f; }

  SchedTask *find(uint8_t id) {
    for (uint8_t i = 0; i < MAX_TASKS; i++)
      if (tasks[i].used && tasks[i].id == id) return &tasks[i];
    return nullptr;
  }

  // Encoder7Bit decode: unpack `outBytes` 8-bit bytes from 7-bit `in`.
  void sched7BitDecode(int outBytes, const uint8_t *in, uint8_t *out) {
    for (int i = 0; i < outBytes; i++) {
      int j = i << 3;
      int pos = j / 7;
      uint8_t shift = j % 7;
      out[i] = (in[pos] >> shift) | ((in[pos + 1] << (7 - shift)) & 0xFF);
    }
  }
  int sched7BitOutBytes(int encodedLen) { return (encodedLen * 7) >> 3; }

  // Decode a 32-bit little-endian value from 5 Encoder7Bit-packed bytes.
  uint32_t sched7BitTime(const uint8_t *enc5) {
    uint8_t b[4];
    sched7BitDecode(4, enc5, b);
    return (uint32_t)b[0] | ((uint32_t)b[1] << 8) | ((uint32_t)b[2] << 16) | ((uint32_t)b[3] << 24);
  }

  // Encoder7Bit encode one byte into frameBuf, carrying state in shift/prev.
  void sched7BitPut(int &n, uint8_t &shift, uint8_t &prev, uint8_t d) {
    if (shift == 0) { frameBuf[n++] = d & 0x7F; shift = 1; prev = d >> 7; }
    else {
      frameBuf[n++] = (uint8_t)((((uint16_t)d << shift) & 0x7F) | prev);
      if (shift == 6) { frameBuf[n++] = d >> 1; shift = 0; }
      else { shift++; prev = d >> (8 - shift); }
    }
  }

