doraorak/ESP32Firmata/ESP32Firmata.ino
  void reset() {
    for (uint8_t i = 0; i < MAX_TASKS; i++) tasks[i].used = false;
    for (uint8_t i = 0; i < NUM_SCHED_REGS; i++) regs[i] = 0;
    for (uint8_t i = 0; i < NUM_FLOAT_REGS; i++) fregs[i] = 0;
    requestCount = 0;
    inspectSel = 0; inspectStale = false; lastStatus = ST_OK;
    for (int s = 0; s < NUM_SNAP; s++) { free(snapBuf[s]); snapBuf[s] = nullptr; snapLen[s] = 0; }
    running = nullptr;
  }

  void sendError(uint8_t id) {
    uint8_t b[5] = { START_SYSEX, SCHEDULER_DATA, SCHED_ERROR_REPLY, id, END_SYSEX };
    sendFrame(b, 5);
  }

  /* Task bodies may themselves contain CREATE/ADD/SCHEDULE/DELETE messages (the
     client recorder's addTask/deleteTask — a task spawning tasks). They arrive
     here through the replay handler exactly like host messages. The one hazard is
     a task deleting then re-creating its OWN id mid-run: never hand out the
     instance currently being replayed (`running`), whose data/pos execute() is
     iterating. */
  void create(uint8_t id, uint16_t len) {
    if (find(id) || len > MAX_TASK_BYTES) { sendError(id); return; }
    for (uint8_t i = 0; i < MAX_TASKS; i++) {
      if (!tasks[i].used && &tasks[i] != running) {
        tasks[i].used = true; tasks[i].id = id;
        tasks[i].time_ms = 0; tasks[i].len = len; tasks[i].pos = 0;
        return;
      }
    }
    sendError(id);  // no free slot
  }

  void deleteTask(uint8_t id) {
    SchedTask *t = find(id);
    if (t) { if (running == t) running = nullptr; t->used = false; }
  }

  void add(uint8_t id, const uint8_t *data, int n) {
    SchedTask *t = find(id);
    if (!t) { sendError(id); return; }
    if ((int)t->pos + n > (int)t->len) return;  // would overflow reserved length
    for (int i = 0; i < n; i++) t->data[t->pos++] = data[i];
  }

  void schedule(uint8_t id, uint32_t delayMs) {
    SchedTask *t = find(id);
    if (!t) { sendError(id); return; }
    t->pos = 0;
    t->loopDepth = 0;
    t->onceMask = 0;
    t->time_ms = millis() + delayMs;
    if (t->time_ms == 0) t->time_ms = 1;        // reserve 0 for "not scheduled"
  }

  // A DELAY_TASK encountered while a task is executing.
  void delayRunning(uint32_t delayMs) {
    if (!running) return;
    uint32_t now = millis();
    running->time_ms += delayMs;
    if ((int32_t)(running->time_ms - now) < 0) running->time_ms = now;
    if (running->time_ms == 0) running->time_ms = 1;
  }

  void queryAll() {
    int n = 0;
    frameBuf[n++] = START_SYSEX; frameBuf[n++] = SCHEDULER_DATA; frameBuf[n++] = SCHED_QUERY_ALL_REPLY;
    for (uint8_t i = 0; i < MAX_TASKS; i++)
      if (tasks[i].used) frameBuf[n++] = tasks[i].id;
    frameBuf[n++] = END_SYSEX;
    sendFrame(frameBuf, n);
  }

  void queryTask(uint8_t id) {
    SchedTask *t = find(id);
    if (!t) { sendError(id); return; }
    int n = 0;
    frameBuf[n++] = START_SYSEX; frameBuf[n++] = SCHEDULER_DATA; frameBuf[n++] = SCHED_QUERY_REPLY;
    frameBuf[n++] = id;
    // payload = time_ms(4 LE) + len(2 LE) + pos(2 LE) + data[len], Encoder7Bit-packed
    uint8_t header[8] = {
      (uint8_t)(t->time_ms), (uint8_t)(t->time_ms >> 8),
      (uint8_t)(t->time_ms >> 16), (uint8_t)(t->time_ms >> 24),
      (uint8_t)(t->len), (uint8_t)(t->len >> 8),
      (uint8_t)(t->pos), (uint8_t)(t->pos >> 8)
    };
    uint8_t shift = 0, prev = 0;
    for (int i = 0; i < 8; i++)             sched7BitPut(n, shift, prev, header[i]);
    for (uint16_t i = 0; i < t->len; i++)   sched7BitPut(n, shift, prev, t->data[i]);
    if (shift > 0) frameBuf[n++] = prev;
    frameBuf[n++] = END_SYSEX;
    sendFrame(frameBuf, n);
  }

  // ---- NON-STANDARD logic extension (see NONSTANDARD.md) ----
  // Compare two operands; if either side is a float, promote the comparison to float.
  bool compare(uint8_t op, const Operand &a, const Operand &b) {
    if (a.isFloat || b.isFloat) {
      float x = a.f, y = b.f;
      switch (op) {
        case 0: return x == y; case 1: return x != y; case 2: return x <  y;
        case 3: return x >  y; case 4: return x <= y; case 5: return x >= y;
        default: return false;
      }
    }
    int32_t x = a.i, y = b.i;
    switch (op) {
      case 0: return x == y; case 1: return x != y; case 2: return x <  y;
      case 3: return x >  y; case 4: return x <= y; case 5: return x >= y;
      default: return false;
    }
  }

  /* Read one operand starting at payload[i]; advances i. Type byte:
     0 = int register, 1 = int const (5 enc bytes), 2 = float register,
     3 = float const (IEEE754 bits, 5 enc bytes). */
  Operand readOperand(const uint8_t *payload, int plen, int &i) {
    Operand o = { false, 0, 0.0f };
    if (i >= plen) return o;
    uint8_t type = payload[i++];
    switch (type) {
      case 0: {                                        // int register
        int32_t v = (i < plen) ? regs[payload[i] & 0x1F] : 0; i++;
        return { false, v, (float)v };
      }
      case 2: {                                        // float register
        float r = (i < plen) ? fregs[payload[i] & (NUM_FLOAT_REGS - 1)] : 0.0f; i++;
        return { true, f2i(r), r };
      }
      case 3: {                                        // float constant
        if (i + 5 > plen) { i = plen; return o; }
        float fv = bitsToFloat(sched7BitTime(payload + i)); i += 5;
        return { true, f2i(fv), fv };
      }
      default: {                                       // 1 = int constant
        if (i + 5 > plen) { i = plen; return o; }
        int32_t v = (int32_t)sched7BitTime(payload + i); i += 5;
        return { false, v, (float)v };
      }
    }
  }

  // Advance the running task's cursor by `amount` bytes (forward-only; clamped).
  void skip(uint16_t amount) {
    if (!running) return;
    uint32_t p = (uint32_t)running->pos + amount;
    running->pos = (p > running->len) ? running->len : (uint16_t)p;
  }

  /* Counted loop (SCHED_EXT_LOOP / _END). LOOP pushes (iterations, gap, body-start pos);
     LOOP_END decrements and either jumps back (gap ms apart, via the delay-suspend) or pops.
     count == 0 or nesting past MAX_LOOP_DEPTH skips the body outright. */
  void loopBegin(uint16_t count, uint32_t gap, uint16_t skipLen) {
    if (!running) return;
    if (count == 0 || running->loopDepth >= MAX_LOOP_DEPTH) { skip(skipLen); return; }
    running->loopRemaining[running->loopDepth] = count;
    running->loopGap[running->loopDepth]       = gap;
    running->loopResume[running->loopDepth]    = running->pos;   // pos = start of the body
    running->loopDepth++;
  }

  void loopEnd() {
    if (!running || running->loopDepth == 0) return;
    uint8_t d = running->loopDepth - 1;
    running->loopRemaining[d]--;
    if (running->loopRemaining[d] > 0) {
      running->pos = running->loopResume[d];                     // jump back to the body
      if (running->loopGap[d] > 0) delayRunning(running->loopGap[d]);  // pause between iterations
    } else {
      running->loopDepth--;                                      // loop finished: pop
    }
  }

  // Send the last HTTP result (status + body) to the connected host.
  void sendHttpReply(int status) {
    int rlen = httpRespBody.length();
    if (rlen > HTTP_PARSE_MAX) rlen = HTTP_PARSE_MAX;
    // Dedicated buffer (frameBuf is only 2 KB): header + body as 14-bit pairs.
    uint8_t *out = (uint8_t *)malloc((size_t)rlen * 2 + 8);
    if (!out) return;
    int n = 0;
    out[n++] = START_SYSEX;
    out[n++] = SCHEDULER_DATA;
    out[n++] = SCHED_EXT_HTTP_REPLY;
    out[n++] = status & 0x7F;
    out[n++] = (status >> 7) & 0x7F;
    const char *body = httpRespBody.c_str();
    for (int k = 0; k < rlen; k++) {           // 14-bit LSB/MSB pairs (like STRING_DATA)
      out[n++] = (uint8_t)body[k] & 0x7F;
      out[n++] = ((uint8_t)body[k] >> 7) & 0x7F;
    }
    out[n++] = END_SYSEX;
    sendFrame(out, n);
    free(out);
  }

  // ====== minimal JSON walker over a byte buffer (mirrors the Swift firmware) ==
  int jsonSkipWs(const uint8_t *b, int blen, int i) {
    while (i < blen && (b[i] == ' ' || b[i] == '\t' || b[i] == '\n' || b[i] == '\r')) i++;
    return i;
  }
  int jsonSkipString(const uint8_t *b, int blen, int i) {   // i at opening quote
    int j = i + 1;
    while (j < blen) {
      if (b[j] == '\\') { j += 2; continue; }                // backslash escape
      if (b[j] == '"') return j + 1;
      j++;
    }
    return j;
  }
  int jsonSkipValue(const uint8_t *b, int blen, int i) {
    int j = jsonSkipWs(b, blen, i);
    if (j >= blen) return j;
    uint8_t c = b[j];
    if (c == '"') return jsonSkipString(b, blen, j);
    if (c == '{' || c == '[') {
      uint8_t open = c, close = (c == '{') ? '}' : ']';
      int k = j + 1, depth = 1;
      while (k < blen && depth > 0) {
        uint8_t d = b[k];
        if (d == '"') { k = jsonSkipString(b, blen, k); continue; }
        if (d == open) depth++; else if (d == close) depth--;
        k++;
      }
      return k;
    }
    int k = j;                                               // number/true/false/null
    while (k < blen) {
      uint8_t d = b[k];
      if (d == ',' || d == '}' || d == ']' || d == ' ' || d == '\t' || d == '\n' || d == '\r') break;
      k++;
    }
    return k;
  }
  int jsonObjectMember(const uint8_t *b, int blen, int pos, const uint8_t *key, int keylen) {
    int j = jsonSkipWs(b, blen, pos);
    if (j >= blen || b[j] != '{') return -1;
    j++;
    while (true) {
      j = jsonSkipWs(b, blen, j);
      if (j >= blen || b[j] == '}') return -1;
      if (b[j] != '"') return -1;
      int ks = j + 1;
      int after = jsonSkipString(b, blen, j); int ke = after - 1;
      bool match = (ke - ks) == keylen;
      if (match) { for (int t = 0; t < keylen; t++) if (b[ks + t] != key[t]) { match = false; break; } }
      j = jsonSkipWs(b, blen, after);
      if (j >= blen || b[j] != ':') return -1;
      j = jsonSkipWs(b, blen, j + 1);
      if (match) return j;
      j = jsonSkipWs(b, blen, jsonSkipValue(b, blen, j));
      if (j < blen && b[j] == ',') { j++; continue; }
      return -1;
    }
  }
  int jsonArrayElement(const uint8_t *b, int blen, int pos, int idx) {
    int j = jsonSkipWs(b, blen, pos);
    if (j >= blen || b[j] != '[') return -1;
    j++;
    int cur = 0;
    while (true) {
      j = jsonSkipWs(b, blen, j);
      if (j >= blen || b[j] == ']') return -1;
      if (cur == idx) return j;
      j = jsonSkipWs(b, blen, jsonSkipValue(b, blen, j));
      if (j < blen && b[j] == ',') { j++; cur++; continue; }
      return -1;
    }
  }
  // Resolve a dotted/indexed path (e.g. "a.b[0].c") to the value's byte span.
  bool jsonValueSpan(const uint8_t *b, int blen, const uint8_t *path, int pathlen,
                     int &outStart, int &outEnd) {
    if (blen <= 0) return false;
    int pos = jsonSkipWs(b, blen, 0);
    int pi = 0;
    while (true) {
      if (pi >= pathlen) { outStart = pos; outEnd = jsonSkipValue(b, blen, pos); return true; }
      if (path[pi] == '.') { pi++; continue; }
      if (path[pi] == '[') {                                 // array index
        pi++; int idx = 0;
        while (pi < pathlen && path[pi] >= '0' && path[pi] <= '9') { idx = idx * 10 + (path[pi] - '0'); pi++; }
        if (pi < pathlen && path[pi] == ']') pi++;
        int p2 = jsonArrayElement(b, blen, pos, idx);
        if (p2 < 0) return false;
        pos = p2;
      } else {                                               // object key
        int ks = pi;
        while (pi < pathlen && path[pi] != '.' && path[pi] != '[') pi++;
        int p2 = jsonObjectMember(b, blen, pos, path + ks, pi - ks);
        if (p2 < 0) return false;
        pos = p2;
      }
    }
  }
  // Parse a JSON number at b[i0] into value × 10^scale (truncated). false if not a number.
  bool parseScaledNumber(const uint8_t *b, int blen, int i0, int scale, int32_t &out) {
    int i = jsonSkipWs(b, blen, i0);
    if (i >= blen) return false;
    bool neg = false;
    if (b[i] == '-') { neg = true; i++; }
    long long intPart = 0; bool anyInt = false;
    while (i < blen && b[i] >= '0' && b[i] <= '9') { intPart = intPart * 10 + (b[i] - '0'); anyInt = true; i++; }
    if (!anyInt) return false;
    uint8_t frac[16]; int fracN = 0;
    if (i < blen && b[i] == '.') {
      i++;
      while (i < blen && b[i] >= '0' && b[i] <= '9') { if (fracN < 16) frac[fracN] = b[i] - '0'; fracN++; i++; }
    }
    long long v = intPart;
    for (int s = 0; s < scale; s++) v = v * 10 + (s < fracN && s < 16 ? frac[s] : 0);
    out = (int32_t)(neg ? -v : v);
    return true;
  }
  bool bytesEqual(const uint8_t *b, int s, int e, const uint8_t *needle, int nlen) {
    if (e - s != nlen) return false;
    for (int t = 0; t < nlen; t++) if (b[s + t] != needle[t]) return false;
    return true;
  }
  bool bytesContain(const uint8_t *b, int s, int e, const uint8_t *needle, int nlen) {
    if (nlen == 0) return true;
    if (e - s < nlen) return false;
    for (int i = s; i <= e - nlen; i++) {
      bool m = true;
      for (int t = 0; t < nlen; t++) if (b[i + t] != needle[t]) { m = false; break; }
      if (m) return true;
    }
    return false;
  }

  /* ====== Response inspection — pick the source, then walk it in place ======
     Source is the live body or a snapshot slot, chosen by SELECT. Returns the
     buffer + length and sets `stale` when a borrowed (live) source was selected
     against an out-of-date generation. Each op records a result-status (read with
     SCHED_EXT_LAST_STATUS). */
  const uint8_t *inspectBuf(int &blen, bool &stale) {
    if (inspectSel == 0) {
      blen = httpRespBody.length(); stale = inspectStale;
      return (const uint8_t *)httpRespBody.c_str();
    }
    int s = inspectSel - 1; stale = false;
    blen = (s >= 0 && s < NUM_SNAP) ? snapLen[s] : 0;
    return (s >= 0 && s < NUM_SNAP) ? snapBuf[s] : nullptr;
  }

  // 10^e as Float by bounded repeated multiply (no libm dependency).
  float pow10f(int e) {
    float r = 1; int n = e;
    if (n >= 0) { while (n > 0) { r *= 10; n--; } } else { while (n < 0) { r /= 10; n++; } }
    return r;
  }
  // Parse a JSON number — or quoted "593.2", with optional exponent — into a Float.
  bool parseFloat(const uint8_t *b, int blen, int i0, float &out) {
    int i = jsonSkipWs(b, blen, i0);
    if (i < blen && b[i] == '"') i++;                          // tolerate a quoted number
    if (i >= blen) return false;
    bool neg = false;
    if (b[i] == '-') { neg = true; i++; }
    float v = 0; bool anyInt = false;
    while (i < blen && b[i] >= '0' && b[i] <= '9') { v = v * 10 + (b[i] - '0'); anyInt = true; i++; }
    if (!anyInt) return false;
    if (i < blen && b[i] == '.') {
      i++; float scale = 1;
      while (i < blen && b[i] >= '0' && b[i] <= '9') { v = v * 10 + (b[i] - '0'); scale *= 10; i++; }
      v /= scale;
    }
    if (neg) v = -v;
    if (i < blen && (b[i] == 'e' || b[i] == 'E')) {            // exponent
      i++; bool eneg = false;
      if (i < blen && (b[i] == '+' || b[i] == '-')) { eneg = (b[i] == '-'); i++; }
      int e = 0;
      while (i < blen && b[i] >= '0' && b[i] <= '9') { e = e * 10 + (b[i] - '0'); i++; }
      v *= pow10f(eneg ? -e : e);
    }
    out = v;
    return true;
  }

