doraorak/ESP32Firmata/ESP32Firmata.ino
  // 0x16: R[dst] = number at JSON <path> × 10^scale (truncated); R[found] = 0/1.
  void doJsonNum(const uint8_t *p, int plen) {
    if (plen < 6) return;
    int dst = p[1] & 0x1F, foundReg = p[2] & 0x1F, scale = p[3];
    int pathLen = p[4] | (p[5] << 7);
    if (6 + pathLen > plen) return;
    const uint8_t *path = p + 6;
    regs[dst] = 0; regs[foundReg] = 0;
    int blen; bool stale; const uint8_t *b = inspectBuf(blen, stale);
    if (stale) { lastStatus = ST_STALE; return; }
    if (blen <= 0 || !b) { lastStatus = ST_NOT_FOUND; return; }
    int s, e; int32_t v;
    if (!jsonValueSpan(b, blen, path, pathLen, s, e)) { lastStatus = ST_NOT_FOUND; return; }
    if (!parseScaledNumber(b, blen, s, scale, v)) { lastStatus = ST_TYPE_MISMATCH; return; }
    regs[dst] = v; regs[foundReg] = 1; lastStatus = ST_OK;
  }
  // 0x17 (eq) / 0x19 (contains): compare JSON string at <path> with <str>.
  void doJsonStr(const uint8_t *p, int plen, bool contains) {
    if (plen < 4) return;
    int dst = p[1] & 0x1F;
    int pathLen = p[2] | (p[3] << 7);
    int i = 4 + pathLen;
    if (i + 2 > plen) return;
    const uint8_t *path = p + 4;
    int strLen = p[i] | (p[i + 1] << 7); i += 2;
    if (i + strLen > plen) return;
    const uint8_t *needle = p + i;
    regs[dst] = 0;
    int blen; bool stale; const uint8_t *b = inspectBuf(blen, stale);
    if (stale) { lastStatus = ST_STALE; return; }
    if (blen <= 0 || !b) { lastStatus = ST_NOT_FOUND; return; }
    int s, e;
    if (!jsonValueSpan(b, blen, path, pathLen, s, e)) { lastStatus = ST_NOT_FOUND; return; }
    if (!(s < e && b[s] == '"')) { lastStatus = ST_TYPE_MISMATCH; return; }
    int cs = s + 1, ce = e - 1;                              // string content (escapes raw)
    if (ce >= cs) regs[dst] = (contains ? bytesContain(b, cs, ce, needle, strLen)
                                        : bytesEqual(b, cs, ce, needle, strLen)) ? 1 : 0;
    lastStatus = ST_OK;
  }
  // 0x18: R[dst] = whole body contains <str> ? 1 : 0.
  void doBodyContains(const uint8_t *p, int plen) {
    if (plen < 4) return;
    int dst = p[1] & 0x1F;
    int strLen = p[2] | (p[3] << 7);
    if (4 + strLen > plen) return;
    const uint8_t *needle = p + 4;
    regs[dst] = 0;
    int blen; bool stale; const uint8_t *b = inspectBuf(blen, stale);
    if (stale) { lastStatus = ST_STALE; return; }
    if (blen <= 0 || !b) { lastStatus = ST_NOT_FOUND; return; }
    regs[dst] = bytesContain(b, 0, blen, needle, strLen) ? 1 : 0; lastStatus = ST_OK;
  }
  // 0x28: R[dst] = byte length of the selected body.
  void doStrBodyLen(const uint8_t *p, int plen) {
    if (plen < 2) return;
    int dst = p[1] & 0x1F;
    regs[dst] = 0;
    int blen; bool stale; const uint8_t *b = inspectBuf(blen, stale);
    if (stale) { lastStatus = ST_STALE; return; }
    if (!b) { lastStatus = ST_NOT_FOUND; return; }
    regs[dst] = blen; lastStatus = ST_OK;
  }
  // 0x29: R[dst] = (whole selected body == <str>) ? 1 : 0.
  void doStrEquals(const uint8_t *p, int plen) {
    if (plen < 4) return;
    int dst = p[1] & 0x1F;
    int strLen = p[2] | (p[3] << 7);
    if (4 + strLen > plen) return;
    const uint8_t *needle = p + 4;
    regs[dst] = 0;
    int blen; bool stale; const uint8_t *b = inspectBuf(blen, stale);
    if (stale) { lastStatus = ST_STALE; return; }
    if (!b) { lastStatus = ST_NOT_FOUND; return; }
    regs[dst] = bytesEqual(b, 0, blen, needle, strLen) ? 1 : 0; lastStatus = ST_OK;
  }
  // 0x2A: R[dst] = index of <str> in the selected body, or -1.
  void doStrIndexOf(const uint8_t *p, int plen) {
    if (plen < 4) return;
    int dst = p[1] & 0x1F;
    int strLen = p[2] | (p[3] << 7);
    if (4 + strLen > plen) return;
    const uint8_t *needle = p + 4;
    regs[dst] = -1;
    int blen; bool stale; const uint8_t *b = inspectBuf(blen, stale);
    if (stale) { lastStatus = ST_STALE; return; }
    if (!b) { lastStatus = ST_NOT_FOUND; return; }
    if (strLen == 0) { regs[dst] = 0; lastStatus = ST_OK; return; }
    if (blen >= strLen) {
      for (int i = 0; i <= blen - strLen; i++) {
        bool m = true;
        for (int t = 0; t < strLen; t++) if (b[i + t] != needle[t]) { m = false; break; }
        if (m) { regs[dst] = i; break; }
      }
    }
    lastStatus = ST_OK;
  }
  // 0x2B: R[dst] = body parsed as a leading integer; R[found] = 0/1.
  void doStrToNum(const uint8_t *p, int plen) {
    if (plen < 3) return;
    int dst = p[1] & 0x1F, foundReg = p[2] & 0x1F;
    regs[dst] = 0; regs[foundReg] = 0;
    int blen; bool stale; const uint8_t *b = inspectBuf(blen, stale);
    if (stale) { lastStatus = ST_STALE; return; }
    if (!b || blen <= 0) { lastStatus = ST_NOT_FOUND; return; }
    int i = 0;
    while (i < blen && (b[i] == 0x20 || b[i] == 0x09)) i++;   // skip leading whitespace
    bool negative = false;
    if (i < blen && b[i] == 0x2D) { negative = true; i++; }
    else if (i < blen && b[i] == 0x2B) i++;
    int32_t val = 0; bool any = false;
    while (i < blen && b[i] >= 0x30 && b[i] <= 0x39) {
      any = true;
      if (val > 214748364) val = 2147483647;                 // clamp to int32 max
      else val = val * 10 + (int32_t)(b[i] - 0x30);
      i++;
    }
    if (any) { regs[dst] = negative ? -val : val; regs[foundReg] = 1; lastStatus = ST_OK; }
    else lastStatus = ST_TYPE_MISMATCH;
  }
  // 0x1D: F[dst] = json float at <path>; R[found] = 0/1.
  void doJsonFloat(const uint8_t *p, int plen) {
    if (plen < 5) return;
    int dst = p[1] & (NUM_FLOAT_REGS - 1), foundReg = p[2] & 0x1F;
    int pathLen = p[3] | (p[4] << 7);
    if (5 + pathLen > plen) return;
    const uint8_t *path = p + 5;
    fregs[dst] = 0; regs[foundReg] = 0;
    int blen; bool stale; const uint8_t *b = inspectBuf(blen, stale);
    if (stale) { lastStatus = ST_STALE; return; }
    if (blen <= 0 || !b) { lastStatus = ST_NOT_FOUND; return; }
    int s, e; float v;
    if (!jsonValueSpan(b, blen, path, pathLen, s, e)) { lastStatus = ST_NOT_FOUND; return; }
    if (!parseFloat(b, blen, s, v)) { lastStatus = ST_TYPE_MISMATCH; return; }
    fregs[dst] = v; regs[foundReg] = 1; lastStatus = ST_OK;
  }
  // Shared setup for the query ops (JSON_TYPE/SIZE/STR_LEN): resolves dst + source.
  bool queryArgs(const uint8_t *p, int plen, int &dst,
                 const uint8_t *&b, int &blen, const uint8_t *&path, int &pathLen) {
    if (plen < 4) return false;
    dst = p[1] & 0x1F;
    pathLen = p[2] | (p[3] << 7);
    if (4 + pathLen > plen) return false;
    path = p + 4;
    regs[dst] = 0;
    bool stale; b = inspectBuf(blen, stale);
    if (stale) { lastStatus = ST_STALE; return false; }
    if (blen <= 0 || !b) { lastStatus = ST_NOT_FOUND; return false; }
    return true;
  }
  // 0x1E: R[dst] = JSON type at path (0 none,1 obj,2 arr,3 str,4 num,5 bool,6 null).
  void doJsonType(const uint8_t *p, int plen) {
    int dst, blen, pathLen; const uint8_t *b, *path;
    if (!queryArgs(p, plen, dst, b, blen, path, pathLen)) return;
    int s, e;
    if (!jsonValueSpan(b, blen, path, pathLen, s, e) || !(s < e)) { lastStatus = ST_NOT_FOUND; return; }
    uint8_t c = b[s]; int32_t t = 0;
    if (c == '{') t = 1;
    else if (c == '[') t = 2;
    else if (c == '"') t = 3;
    else if ((c >= '0' && c <= '9') || c == '-') t = 4;
    else if (c == 't' || c == 'f') t = 5;
    else if (c == 'n') t = 6;
    regs[dst] = t; lastStatus = ST_OK;
  }
  // 0x1F: R[dst] = byte length of the value span at path (for sizing a snapshot).
  void doJsonSize(const uint8_t *p, int plen) {
    int dst, blen, pathLen; const uint8_t *b, *path;
    if (!queryArgs(p, plen, dst, b, blen, path, pathLen)) return;
    int s, e;
    if (jsonValueSpan(b, blen, path, pathLen, s, e)) { regs[dst] = (int32_t)(e - s); lastStatus = ST_OK; }
    else { regs[dst] = 0; lastStatus = ST_NOT_FOUND; }
  }
  // 0x20: R[dst] = content length of the JSON string at path (0 if not a string).
  void doStrLen(const uint8_t *p, int plen) {
    int dst, blen, pathLen; const uint8_t *b, *path;
    if (!queryArgs(p, plen, dst, b, blen, path, pathLen)) return;
    int s, e;
    if (!jsonValueSpan(b, blen, path, pathLen, s, e)) { regs[dst] = 0; lastStatus = ST_NOT_FOUND; return; }
    if (e - s >= 2 && b[s] == '"') { regs[dst] = (int32_t)(e - s - 2); lastStatus = ST_OK; }
    else { regs[dst] = 0; lastStatus = ST_TYPE_MISMATCH; }
  }
  // 0x1A: R[dst] = A <op> B (int; op 0+ 1- 2* 3/ 4%). 64-bit intermediates; ÷/%0 -> 0.
  void doArith(const uint8_t *p, int plen) {
    if (plen < 3) return;
    uint8_t sub = p[1]; int dst = p[2] & 0x1F;
    int i = 3;
    int32_t a = readOperand(p, plen, i).i;
    int32_t b = readOperand(p, plen, i).i;
    int32_t r = 0;
    switch (sub) {
      case 0: r = a + b; break;
      case 1: r = a - b; break;
      case 2: r = (int32_t)((int64_t)a * (int64_t)b); break;
      case 3: r = (b != 0) ? (int32_t)((int64_t)a / (int64_t)b) : 0; break;
      case 4: r = (b != 0) ? (int32_t)((int64_t)a % (int64_t)b) : 0; break;
      default: r = 0;
    }
    regs[dst] = r;
  }
  // 0x1C: F[dst] = A <op> B (float; op 0+ 1- 2* 3/). ÷0 -> 0.
  void doArithFloat(const uint8_t *p, int plen) {
    if (plen < 3) return;
    uint8_t sub = p[1]; int dst = p[2] & (NUM_FLOAT_REGS - 1);
    int i = 3;
    float a = readOperand(p, plen, i).f;
    float b = readOperand(p, plen, i).f;
    float r = 0;
    switch (sub) {
      case 0: r = a + b; break;
      case 1: r = a - b; break;
      case 2: r = a * b; break;
      case 3: r = (b != 0) ? a / b : 0; break;
      default: r = 0;
    }
    fregs[dst] = r;
  }
  // 0x1B: F[dst] = float constant (IEEE754 bits in 5 Encoder7Bit bytes).
  void doSetFloat(const uint8_t *p, int plen) {
    if (plen != 7) return;
    fregs[p[1] & (NUM_FLOAT_REGS - 1)] = bitsToFloat(sched7BitTime(p + 2));
  }
  // 0x27: R[dst] = (A <op> B) ? 1 : 0 (same operand decoding + float promotion as IF).
  void doCmp(const uint8_t *p, int plen) {
    if (plen < 3) return;
    uint8_t op = p[1]; int dst = p[2] & 0x1F;
    int i = 3;
    Operand a = readOperand(p, plen, i);
    Operand b = readOperand(p, plen, i);
    regs[dst] = compare(op, a, b) ? 1 : 0;
  }
  // 0x22: R[dst] = current request count (generation; ++ per HTTP request).
  void doReadRequestCount(const uint8_t *p, int plen) {
    if (plen < 2) return;
    regs[p[1] & 0x1F] = requestCount;
  }
  // 0x21: R[freeReg] = free heap, R[largestReg] = largest free block.
  void doHeap(const uint8_t *p, int plen) {
    if (plen < 3) return;
    regs[p[1] & 0x1F] = (int32_t)ESP.getFreeHeap();
    regs[p[2] & 0x1F] = (int32_t)ESP.getMaxAllocHeap();
  }
  // 0x26: R[dst] = status of the last inspection op.
  void doLastStatus(const uint8_t *p, int plen) {
    if (plen < 2) return;
    regs[p[1] & 0x1F] = lastStatus;
  }
  // 0x24: select inspection source — 0 = live body (stale if requestCount != R[expGenReg]),
  //       k = snapshot slot k-1 (always valid).
  void doSelect(const uint8_t *p, int plen) {
    if (plen < 3) return;
    inspectSel = p[1];
    inspectStale = (inspectSel == 0) ? (requestCount != regs[p[2] & 0x1F]) : false;
  }
  // 0x25: free snapshot slot <slot>.
  void doFree(const uint8_t *p, int plen) {
    if (plen < 2) return;
    int slot = p[1];
    if (slot >= 0 && slot < NUM_SNAP) { free(snapBuf[slot]); snapBuf[slot] = nullptr; snapLen[slot] = 0; }
  }
  // 0x23: copy the value at <path> from the LIVE body into snapshot slot <slot>
  //       (pathLen 0 = whole body). Grow-only realloc keeps the copy until freed.
  void doSnapshot(const uint8_t *p, int plen) {
    if (plen < 4) return;
    int slot = p[1]; if (slot < 0 || slot >= NUM_SNAP) return;
    int pathLen = p[2] | (p[3] << 7);
    if (4 + pathLen > plen) return;
    const uint8_t *path = p + 4;
    const uint8_t *b = (const uint8_t *)httpRespBody.c_str();
    int blen = httpRespBody.length();
    if (blen <= 0) { lastStatus = ST_NOT_FOUND; return; }
    int s, e;
    if (!jsonValueSpan(b, blen, path, pathLen, s, e) || e <= s) { lastStatus = ST_NOT_FOUND; return; }
    int n = e - s;
    uint8_t *nb = (uint8_t *)realloc(snapBuf[slot], n);
    if (!nb) { lastStatus = ST_ALLOC_FAILED; return; }
    memcpy(nb, b + s, n);
    snapBuf[slot] = nb; snapLen[slot] = n;
    lastStatus = ST_OK;
  }
  // 0x2C: copy the CONTENT (unquoted) of the JSON string at <path> from the LIVE body into
  //       snapshot slot <slot>. Backs board.json.getString → a TaskString for board.string.
  void doJsonGetString(const uint8_t *p, int plen) {
    if (plen < 4) return;
    int slot = p[1]; if (slot < 0 || slot >= NUM_SNAP) return;
    int pathLen = p[2] | (p[3] << 7);
    if (4 + pathLen > plen) return;
    const uint8_t *path = p + 4;
    const uint8_t *b = (const uint8_t *)httpRespBody.c_str();
    int blen = httpRespBody.length();
    if (blen <= 0) { lastStatus = ST_NOT_FOUND; return; }
    int s, e;
    if (!jsonValueSpan(b, blen, path, pathLen, s, e) || e <= s) { lastStatus = ST_NOT_FOUND; return; }
    if (b[s] != '"' || e - 1 <= s) { lastStatus = ST_TYPE_MISMATCH; return; }   // must be a JSON string
    int cs = s + 1, n = (e - 1) - cs;                       // content between the quotes
    uint8_t *nb = (uint8_t *)realloc(snapBuf[slot], n > 0 ? n : 1);
    if (!nb) { lastStatus = ST_ALLOC_FAILED; return; }
    if (n > 0) memcpy(nb, b + cs, n);
    snapBuf[slot] = nb; snapLen[slot] = n;
    lastStatus = ST_OK;
  }
  // 0x2D: set snapshot slot <slot> to the literal string in the payload — backs
  //       board.string.createString (board.string ops then run on the slot).
  void doStrSetSlot(const uint8_t *p, int plen) {
    if (plen < 4) return;
    int slot = p[1]; if (slot < 0 || slot >= NUM_SNAP) return;
    int sLen = p[2] | (p[3] << 7);
    if (4 + sLen > plen) return;
    uint8_t *nb = (uint8_t *)realloc(snapBuf[slot], sLen > 0 ? sLen : 1);
    if (!nb) { lastStatus = ST_ALLOC_FAILED; return; }
    if (sLen > 0) memcpy(nb, p + 4, sLen);
    snapBuf[slot] = nb; snapLen[slot] = sLen;
    lastStatus = ST_OK;
  }
  // 0x2E: copy snapshot slot <src> content into slot <dst> (backs string changeSlot).
  void doStrCopySlot(const uint8_t *p, int plen) {
    if (plen < 3) return;
    int dst = p[1], src = p[2];
    if (dst < 0 || dst >= NUM_SNAP || src < 0 || src >= NUM_SNAP) return;
    if (!snapBuf[src]) { lastStatus = ST_NOT_FOUND; return; }
    int n = snapLen[src];
    uint8_t *nb = (uint8_t *)realloc(snapBuf[dst], n > 0 ? n : 1);
    if (!nb) { lastStatus = ST_ALLOC_FAILED; return; }
    if (n > 0) memcpy(nb, snapBuf[src], n);
    snapBuf[dst] = nb; snapLen[dst] = n;
    lastStatus = ST_OK;
  }

  /* 0x2F: write the register pointer, read <count> (1..4) bytes from the I2C device, and
           store them big-endian in R[dst]. Lets a task act on an I2C sensor with nobody
           connected (the read reply is consumed on-device, not sent to a host). */
  void doI2CReadReg(const uint8_t *p, int plen) {
    if (plen < 6) return;
    uint16_t address = p[1] & 0x7F;
    int reg   = p[2] | (p[3] << 7);
    int count = p[4]; if (count < 1) count = 1; if (count > 4) count = 4;
    int dst   = p[5] & 0x1F;
    Wire.beginTransmission(address);
    Wire.write((uint8_t)reg);
    Wire.endTransmission();
    if (i2cReadDelayUs) delayMicroseconds(i2cReadDelayUs);
    int got = Wire.requestFrom((int)address, count);
    int32_t v = 0; int i = 0;
    while (Wire.available() && i < got && i < count) { v = (v << 8) | (Wire.read() & 0xFF); i++; }
    regs[dst] = v;
  }

  // 0x30: send a STRING_DATA frame (board -> host) so a running task can report a message
  //       to a connected master (TCP or BLE). No-op if nobody is connected.
  /* 0x32: write a pin from an OPERAND (register or literal) — task values drive
     outputs: kind 0 = digital (non-zero -> HIGH, OUTPUT pins only), kind 1 =
     analog, routed by the pin's mode (PWM duty or servo degrees/us). */
  void writePinOp(const uint8_t *payload, int plen) {
    if (plen < 4) return;
    uint8_t kind = payload[1];
    uint8_t pin = payload[2] & 0x7F;
    if (pin >= TOTAL_PINS) return;
    int i = 3;
    Operand v = readOperand(payload, plen, i);
    int value = (int)(v.isFloat ? f2i(v.f) : v.i);
    if (kind == 0) {
      if (pinModes[pin] == PIN_MODE_OUTPUT) {
        digitalWrite(pin, value != 0 ? HIGH : LOW);
        pinValues[pin] = value != 0 ? 1 : 0;
      }
    } else {
      if (pinModes[pin] == PIN_MODE_PWM) {
        int hi = pwmMaxDuty[pin];
        fmPwmWrite(pin, value > hi ? hi : (value < 0 ? 0 : value));
        pinValues[pin] = value;
      } else if (pinModes[pin] == PIN_MODE_SERVO) {
        replay->servoOut(pin, value);
      } else if (pinModes[pin] == PIN_MODE_DAC) {
        replay->dacOut(pin, value);
      }
    }
  }

  /* 0x31: report every register to the connected host as SCHED_REG_REPLY —
     16 Int32s then 8 float bit-patterns, each as 5 little-endian 7-bit limbs.
     Works live (host polls shared state) or from inside a task. */
  void regReport() {
    int n = 0;
    frameBuf[n++] = START_SYSEX;
    frameBuf[n++] = SCHEDULER_DATA;
    frameBuf[n++] = SCHED_REG_REPLY;
    for (uint8_t i = 0; i < NUM_SCHED_REGS; i++) {
      uint32_t v = (uint32_t)regs[i];
      for (uint8_t k = 0; k < 5; k++) { frameBuf[n++] = v & 0x7F; v >>= 7; }
    }
    for (uint8_t i = 0; i < NUM_FLOAT_REGS; i++) {
      uint32_t v; memcpy(&v, &fregs[i], 4);
      for (uint8_t k = 0; k < 5; k++) { frameBuf[n++] = v & 0x7F; v >>= 7; }
    }
    frameBuf[n++] = END_SYSEX;
    sendFrame(frameBuf, n);
  }

  void doEmitString(const uint8_t *p, int plen) {
    if (plen < 3) return;
    int sLen = p[1] | (p[2] << 7);
    if (3 + sLen > plen) return;
    int n = 0;
    frameBuf[n++] = START_SYSEX;
    frameBuf[n++] = STRING_DATA;
    for (int k = 0; k < sLen; k++) { frameBuf[n++] = p[3 + k] & 0x7F; frameBuf[n++] = 0; }
    frameBuf[n++] = END_SYSEX;
    sendFrame(frameBuf, n);
  }

  // Internet action: a task (or live host) makes an HTTP(S) request over Wi-Fi.
  // ext payload: 0x15 method statusReg urlLo urlHi url[] bodyLo bodyHi body[].
  // method 0=GET 1=POST. Stores HTTP status in R[statusReg] (0 = Wi-Fi down/error)
  // and retains the full response body for the inspection ops (JSON_NUM/*_STR_*/
  // BODY_*). If a host is connected, status + body return as SCHED_EXT_HTTP_REPLY.
  // https:// is validated against the IDF cert bundle (see README).
  void doHttp(const uint8_t *p, int plen) {
    if (plen < 5) return;
    uint8_t method   = p[1];
    int     statusReg = p[2] & 0x1F;
    int     urlLen    = p[3] | (p[4] << 7);
    int i = 5;
    if (urlLen <= 0 || i + urlLen > plen) return;
    String url; url.reserve(urlLen + 1);
    for (int k = 0; k < urlLen; k++) url += (char)p[i + k];
    i += urlLen;
    int bodyLen = 0;
    if (i + 2 <= plen) { bodyLen = p[i] | (p[i + 1] << 7); i += 2; }
    if (bodyLen < 0 || i + bodyLen > plen) bodyLen = 0;
    String body; body.reserve(bodyLen + 1);
    for (int k = 0; k < bodyLen; k++) body += (char)p[i + k];

    httpRespBody = "";
    int status = 0;
#if ENABLE_WIFI
    if (WiFi.status() == WL_CONNECTED) {
      bool https = url.startsWith("https");
      HTTPClient http;
      http.setConnectTimeout(8000);
      http.setTimeout(8000);
      http.setReuse(false);
      http.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);
      WiFiClientSecure tls;
      WiFiClient plain;
      bool ok;
      if (https) {
        tls.setCACertBundle(fm_crt_bundle_start,
                            (size_t)(fm_crt_bundle_end - fm_crt_bundle_start));  // validate certs
        ok = http.begin(tls, url);
      } else {
        ok = http.begin(plain, url);
      }
      if (ok) {
        if (method == 1) {
          http.addHeader("Content-Type", "application/json");
          status = http.POST((uint8_t *)body.c_str(), body.length());
        } else {
          status = http.GET();
        }
        if (status > 0) httpRespBody = http.getString();
        http.end();
      }
    }
#endif
    regs[statusReg] = status;
    requestCount++;                       // the retained body just changed (handle-staleness basis)
    if (transportConnected()) sendHttpReply(status);
  }

