doraorak/ESP32Firmata/ESP32Firmata.ino
  void handleExt(const uint8_t *payload, int plen) {
    switch (payload[0]) {
      case SCHED_EXT_SET:               // 0x10 reg <const:5>
        if (plen == 7) regs[payload[1] & 0x1F] = (int32_t)sched7BitTime(payload + 2);
        break;
      case SCHED_EXT_READ_DIGITAL:      // 0x11 reg pin
        if (plen == 3) regs[payload[1] & 0x1F] = digitalRead(payload[2]) ? 1 : 0;
        break;
      case SCHED_EXT_READ_ANALOG: {     // 0x12 reg channel
        if (plen == 3) {
          uint8_t ch = payload[2];
          if (ch >= TOUCH_CHANNEL_BASE) {
            int pin = pinOfTouchChannel(ch);
            regs[payload[1] & 0x1F] =
              (pin >= 0 && pinModes[pin] == PIN_MODE_TOUCH) ? (int32_t)touchRead((uint8_t)pin) : 0;
          } else {
            int pin = pinOfAnalogChannel(ch);
            regs[payload[1] & 0x1F] = (pin >= 0) ? analogRead(pin) : 0;
          }
        }
        break;
      }
      case SCHED_EXT_IF: {              // 0x13 op <operandA> <operandB> skipLo skipHi
        int i = 1;
        uint8_t op = payload[i++];
        Operand a = readOperand(payload, plen, i);
        Operand b = readOperand(payload, plen, i);
        if (i + 2 > plen) break;
        uint16_t amount = (uint16_t)(payload[i] | (payload[i + 1] << 7));
        if (!compare(op, a, b)) skip(amount);   // condition false -> skip block
        break;
      }
      case SCHED_EXT_SKIP:             // 0x14 skipLo skipHi  (unconditional; for else)
        if (plen == 3) skip((uint16_t)(payload[1] | (payload[2] << 7)));
        break;
      case SCHED_EXT_HTTP:            // 0x15 internet request (see NONSTANDARD.md)
        doHttp(payload, plen);
        break;
      case SCHED_EXT_JSON_NUM:           // 0x16 dst found scale pathLo pathHi path…
        doJsonNum(payload, plen);
        break;
      case SCHED_EXT_JSON_STR_EQ:        // 0x17 dst pathLo pathHi path… strLo strHi str…
        doJsonStr(payload, plen, false);
        break;
      case SCHED_EXT_BODY_CONTAINS:      // 0x18 dst strLo strHi str…
        doBodyContains(payload, plen);
        break;
      case SCHED_EXT_JSON_STR_CONTAINS:  // 0x19 dst pathLo pathHi path… strLo strHi str…
        doJsonStr(payload, plen, true);
        break;
      case SCHED_EXT_ARITH:              // 0x1A subop dst <operandA> <operandB>
        doArith(payload, plen);
        break;
      case SCHED_EXT_SET_FLOAT:          // 0x1B fdst <const:5>
        doSetFloat(payload, plen);
        break;
      case SCHED_EXT_ARITH_FLOAT:        // 0x1C subop fdst <operandA> <operandB>
        doArithFloat(payload, plen);
        break;
      case SCHED_EXT_JSON_FLOAT:         // 0x1D fdst found pathLo pathHi path…
        doJsonFloat(payload, plen);
        break;
      case SCHED_EXT_JSON_TYPE:          // 0x1E dst pathLo pathHi path…
        doJsonType(payload, plen);
        break;
      case SCHED_EXT_JSON_SIZE:          // 0x1F dst pathLo pathHi path…
        doJsonSize(payload, plen);
        break;
      case SCHED_EXT_STR_LEN:            // 0x20 dst pathLo pathHi path…
        doStrLen(payload, plen);
        break;
      case SCHED_EXT_HEAP:               // 0x21 freeReg largestReg
        doHeap(payload, plen);
        break;
      case SCHED_EXT_REQUEST_COUNT:      // 0x22 dst
        doReadRequestCount(payload, plen);
        break;
      case SCHED_EXT_SNAPSHOT:           // 0x23 slot pathLo pathHi path…
        doSnapshot(payload, plen);
        break;
      case SCHED_EXT_SELECT:             // 0x24 sel expGenReg
        doSelect(payload, plen);
        break;
      case SCHED_EXT_FREE:               // 0x25 slot
        doFree(payload, plen);
        break;
      case SCHED_EXT_LAST_STATUS:        // 0x26 dst
        doLastStatus(payload, plen);
        break;
      case SCHED_EXT_CMP:                // 0x27 op dst <operandA> <operandB>
        doCmp(payload, plen);
        break;
      case SCHED_EXT_STR_BODY_LEN:      // 0x28 dst
        doStrBodyLen(payload, plen);
        break;
      case SCHED_EXT_STR_EQUALS:        // 0x29 dst strLo strHi str…
        doStrEquals(payload, plen);
        break;
      case SCHED_EXT_STR_INDEXOF:       // 0x2A dst strLo strHi str…
        doStrIndexOf(payload, plen);
        break;
      case SCHED_EXT_STR_TO_NUM:        // 0x2B dst found
        doStrToNum(payload, plen);
        break;
      case SCHED_EXT_JSON_GET_STRING:   // 0x2C slot pathLo pathHi path…
        doJsonGetString(payload, plen);
        break;
      case SCHED_EXT_STR_SET_SLOT:      // 0x2D slot strLo strHi str…
        doStrSetSlot(payload, plen);
        break;
      case SCHED_EXT_STR_COPY_SLOT:     // 0x2E dst src
        doStrCopySlot(payload, plen);
        break;
      case SCHED_EXT_I2C_READ:          // 0x2F addr regLo regHi count dst
        doI2CReadReg(payload, plen);
        break;
      case SCHED_EXT_EMIT_STRING:       // 0x30 lenLo lenHi bytes…
        doEmitString(payload, plen);
        break;
      case SCHED_EXT_REG_QUERY:         // 0x31: snapshot R0-15 + F0-7 to the host
        regReport();
        break;
      case SCHED_EXT_WRITE_PIN:         // 0x32 kind pin <operand>
        writePinOp(payload, plen);
        break;
      case SCHED_EXT_MODULE_OP:         // 0x33 <moduleId> <payload…>
        if (plen >= 2) moduleDispatch(payload[1], payload + 2, plen - 2);
        break;
      case SCHED_EXT_LOOP:              // 0x34 countLo countHi gapLo gapHi skipLo skipHi
        if (plen == 7) {
          uint16_t count   = (uint16_t)payload[1] | ((uint16_t)payload[2] << 7);
          uint32_t gap     = (uint32_t)payload[3] | ((uint32_t)payload[4] << 7);
          uint16_t skipLen = (uint16_t)payload[5] | ((uint16_t)payload[6] << 7);
          loopBegin(count, gap, skipLen);
        }
        break;
      case SCHED_EXT_LOOP_END:          // 0x35
        loopEnd();
        break;
      case SCHED_EXT_PWM_FREQ: {        // 0x36 pin <operand> — retune from a runtime value (8-bit duty)
        if (plen >= 4) {
          uint8_t pin = payload[1] & 0x7F;
          if (pin < TOTAL_PINS && isFullDigital(pin)) {
            int i = 2;
            Operand v = readOperand(payload, plen, i);
            int32_t freq = v.isFloat ? f2i(v.f) : v.i;
            if (freq < 1) freq = 1;
            if (freq > 0x1FFFFF) freq = 0x1FFFFF;
            int slot = fmLedcSlotOf(pin);
            if (slot < 0) {
              for (int k = 0; k < FM_LEDC_SLOTS; k++) if (fmLedcPin[k] < 0) { slot = k; break; }
              if (slot >= 0) {
                fmLedcPin[slot] = pin;
                fmLedcRes[slot] = 8;
                fmLedcTimerInit(slot, (uint32_t)freq, 8);
                ledc_channel_config_t c = {};
                c.gpio_num   = pin;
                c.speed_mode = LEDC_LOW_SPEED_MODE;
                c.channel    = (ledc_channel_t)(7 - slot);
                c.intr_type  = LEDC_INTR_DISABLE;
                c.timer_sel  = (ledc_timer_t)(3 - slot);
                c.duty       = 0;
                c.hpoint     = 0;
                ledc_channel_config(&c);
              }
            } else {
              ledc_set_freq(LEDC_LOW_SPEED_MODE, (ledc_timer_t)(3 - slot), (uint32_t)freq);
            }
            if (slot >= 0) {
              pwmMaxDuty[pin] = 255;
              pinModes[pin] = PIN_MODE_PWM;
              pinConfigured[pin] = true;
            }
          }
        }
        break;
      }
      case SCHED_EXT_DELAY_OP: {        // 0x37 <operand> — delay ms from a runtime value
        if (plen >= 3) {
          int i = 1;
          Operand v = readOperand(payload, plen, i);
          int32_t msv = v.isFloat ? f2i(v.f) : v.i;
          if (msv > 0) delayRunning((uint32_t)msv);
        }
        break;
      }
      case SCHED_EXT_ONCE: {            // 0x38 idx skipLo skipHi — run body on first pass only
        if (plen == 4 && running != nullptr) {
          int idx = payload[1] & 0x1F;
          uint16_t skipLen = (uint16_t)(payload[2] & 0x7F) | ((uint16_t)(payload[3] & 0x7F) << 7);
          if (running->onceMask & (1UL << idx)) {
            skip(skipLen);                          // already ran: jump over the body
          } else {
            running->onceMask |= (1UL << idx);      // first pass: mark and fall through
          }
        }
        break;
      }
    }
  }

  void handleSysex(const uint8_t *payload, int plen) {
    if (plen < 1) return;
    switch (payload[0]) {
      case SCHED_CREATE:
        if (plen == 4) create(payload[1], (uint16_t)(payload[2] | (payload[3] << 7)));
        break;
      case SCHED_DELETE:
        if (plen == 2) deleteTask(payload[1]);
        break;
      case SCHED_ADD:
        if (plen > 2) {
          int outLen = sched7BitOutBytes(plen - 2);
          static uint8_t dec[MAX_TASK_BYTES];
          if (outLen > (int)sizeof(dec)) outLen = sizeof(dec);
          sched7BitDecode(outLen, payload + 2, dec);
          add(payload[1], dec, outLen);
        }
        break;
      case SCHED_DELAY:
        if (plen == 6) delayRunning(sched7BitTime(payload + 1));
        break;
      case SCHED_SCHEDULE:
        if (plen == 7) schedule(payload[1], sched7BitTime(payload + 2));
        break;
      case SCHED_EXT_COMMAND:            // 0x7F: our logic ops live under the
        if (plen >= 2) handleExt(payload + 1, plen - 1);  // reserved extension cmd
        break;
      case SCHED_QUERY_ALL: queryAll(); break;
      case SCHED_QUERY:     if (plen == 2) queryTask(payload[1]); break;
      case SCHED_RESET:     reset(); break;
      default: break;
    }
  }

  // Replay a task's bytes through the replay handler until a delay reschedules it
  // or it finishes. Returns true if the task should be kept (rescheduled/looping).
  bool execute(SchedTask *t) {
    uint32_t start = t->time_ms;
    running = t;
    replay->ps = ParserState();                 // each run resumes at a message boundary
    while (t->pos < t->len) {
      replay->process(t->data[t->pos++]);
      if (t->time_ms != start) {                // a DELAY_TASK fired (or a loop's inter-iteration gap)
        if (t->pos >= t->len) { t->pos = 0; t->loopDepth = 0; }   // trailing delay -> loop from the start
        running = nullptr;
        return true;
      }
    }
    running = nullptr;
    return false;                               // ran to end with no trailing delay -> one-shot
  }

  void tick() {
    uint32_t now = millis();
    for (uint8_t i = 0; i < MAX_TASKS; i++) {
      SchedTask *t = &tasks[i];
      if (t->used && t->time_ms != 0 && (int32_t)(now - t->time_ms) >= 0) {
        if (!execute(t)) t->used = false;  // one-shot finished -> free the slot
      }
    }
  }
};

// Now that Scheduler is complete, define the handler's scheduler-dispatching SysEx.
#if ENABLE_WIFI
static void handleWiFiConfig(const uint8_t *data, int dlen);   // defined in the Wi-Fi section
#endif

