doraorak/ESP32Firmata/ESP32Firmata.ino
void FirmataProtocol::processSysex(const uint8_t *buf, int len) {
  if (len < 1) return;
  uint8_t cmd = buf[0];
  const uint8_t *data = buf + 1;
  int dlen = len - 1;

  switch (cmd) {
#if ENABLE_WIFI
    case MODULE_DATA:           handleModuleData(data, dlen);  break;
    case WIFI_CONFIG:           handleWiFiConfig(data, dlen);  break;
#endif
    case REPORT_FIRMWARE:       sendFirmwareReport();        break;
    case CAPABILITY_QUERY:      sendCapabilityResponse();    break;
    case ANALOG_MAPPING_QUERY:  sendAnalogMappingResponse(); break;
    case PIN_STATE_QUERY:       if (dlen >= 1) sendPinStateResponse(data[0]); break;
    case EXTENDED_ANALOG:       handleExtendedAnalog(data, dlen); break;
    case SAMPLING_INTERVAL:
      if (dlen >= 2) {
        samplingInterval = (data[0] & 0x7F) | ((data[1] & 0x7F) << 7);
        if (samplingInterval < MIN_SAMPLING) samplingInterval = MIN_SAMPLING;
      }
      break;
    case STRING_DATA:           handleString(data, dlen);    break;
    case SERVO_CONFIG:          handleServoConfig(data, dlen); break;
    case PWM_CONFIG:            handlePwmConfig(data, dlen); break;
    case TONE_CONFIG:           handleTone(data, dlen); break;
    case I2C_CONFIG:            handleI2CConfig(data, dlen);  break;
    case I2C_REQUEST:           handleI2CRequest(data, dlen); break;
    case SCHEDULER_DATA:        sched->handleSysex(data, dlen); break;
    default:                    break;  // unknown SysEx ignored
  }
}

// Singletons: live handler, replay handler (for task playback), and scheduler.
// Cross-references are wired once in setup().
static Scheduler       scheduler;
static FirmataProtocol liveHandler;
static FirmataProtocol replayHandler;

/* ==== Periodic sampling (device -> host) ================================ */
static void checkDigitalInputs() {
  for (uint8_t port = 0; port < NUM_PORTS; port++) {
    if (!reportPort[port]) continue;
    uint8_t mask = 0;
    for (int i = 0; i < 8; i++) {
      uint8_t pin = port * 8 + i;
      if (pin >= TOTAL_PINS) break;
      if (!isUsable(pin) || !pinConfigured[pin]) continue;  // skip floating, unconfigured pins
      uint8_t m = pinModes[pin];
      if (m == PIN_MODE_INPUT || m == PIN_MODE_PULLUP) {
        if (digitalRead(pin)) mask |= (1 << i);
      } else if (m == PIN_MODE_OUTPUT) {
        if (pinValues[pin]) mask |= (1 << i);
      }
    }
    if (mask != previousPort[port]) {
      previousPort[port] = mask;
      sendDigitalPort(port, mask);
    }
  }
}

static void sampleAnalogAndI2C() {
  // ADC on channels 0-5, touch sensors on 6-15.
  for (uint8_t ch = 0; ch < 16; ch++) {
    if (!(analogReportMask & (1 << ch))) continue;
    if (ch < NUM_ANALOG) {
      int pin = pinOfAnalogChannel(ch);
      if (pin >= 0) sendAnalogReport(ch, analogRead(pin));
    } else {
      int pin = pinOfTouchChannel(ch);
      if (pin >= 0 && pinModes[pin] == PIN_MODE_TOUCH)
        sendAnalogReport(ch, (int)touchRead((uint8_t)pin));
    }
  }
  for (uint8_t i = 0; i < MAX_CONT_READS; i++) {
    if (contReads[i].active)
      i2cDoRead(contReads[i].address, contReads[i].reg, contReads[i].count);
  }
}

/* ==== Reset
   Light reset for a fresh connection: clears the live parser and reporting
   state but PRESERVES pin modes/values and any running scheduler tasks, so a
   queued task keeps running across client disconnect/reconnect.
   ==================== */
static void resetSessionState() {
  liveHandler.ps = ParserState();
  analogReportMask = 0;
  for (uint8_t i = 0; i < NUM_PORTS; i++) { reportPort[i] = false; previousPort[i] = 0; }
  for (uint8_t i = 0; i < MAX_CONT_READS; i++) contReads[i].active = false;
}

// Full reset (Firmata SYSTEM_RESET 0xFF, and at boot): also resets every pin
// and deletes all scheduler tasks.
static void systemResetState() {
  resetSessionState();
  replayHandler.ps = ParserState();
  scheduler.reset();
  for (uint8_t pin = 0; pin < TOTAL_PINS; pin++) {
    if (isUsable(pin)) pinMode(pin, INPUT);
    pinModes[pin]      = PIN_MODE_INPUT;
    pinValues[pin]     = 0;
    pinConfigured[pin] = false;
  }
  moduleReset();       // the pin-mode reset above detaches RMT receivers — let modules re-arm
  for (uint8_t pin = 0; pin < TOTAL_PINS; pin++) toneOffMs[pin] = 0;
  toneTimersActive = 0;   // the pin reset stopped any tones
  samplingInterval = 19;
}

// Called when a fresh client/central attaches. Does NOT wipe pins or tasks.
static void onNewConnection() {
  resetSessionState();
  sendProtocolVersion();
}

/* Build the standard STRING_DATA "eviction notice" the board sends to a client
   right before handing the board to a newcomer (latest-wins). The sentinel
   (0x01 + "EVICTED") is recognised by SwiftFirmataClient. Returns the length. */
static int buildEvictionFrame(uint8_t *out) {
  static const char *s = "\x01" "EVICTED";
  int n = 0;
  out[n++] = START_SYSEX;
  out[n++] = STRING_DATA;
  for (const char *p = s; *p; ++p) {
    out[n++] = (uint8_t)(*p) & 0x7F;
    out[n++] = ((uint8_t)(*p) >> 7) & 0x7F;
  }
  out[n++] = END_SYSEX;
  return n;
}

/* ==== TRANSPORT — Wi-Fi / Bonjour ======================================= */
#if ENABLE_WIFI

static WiFiServer tcpServer(FIRMATA_TCP_PORT);
static WiFiClient tcpClient;
static bool       wifiReady = false;

static void startBonjour() {
  MDNS.end();
  if (!MDNS.begin(MDNS_HOSTNAME)) {
    LOGLN("mDNS start failed");
    return;
  }
  MDNS.addService("firmata", "tcp", FIRMATA_TCP_PORT);   // -> _firmata._tcp
  String ip = WiFi.localIP().toString();
  MDNS.addServiceTxt("firmata", "tcp", "ip",   ip.c_str());
  MDNS.addServiceTxt("firmata", "tcp", "port", String(FIRMATA_TCP_PORT).c_str());
  LOGF("Bonjour: _firmata._tcp on %s:%d (instance \"%s\")\n",
                ip.c_str(), FIRMATA_TCP_PORT, MDNS_HOSTNAME);
}

static void startTcpServices() {
  startBonjour();
  tcpServer.begin();
  tcpServer.setNoDelay(true);
  wifiReady = true;
  LOGP("Wi-Fi up. IP = ");
  LOGLN(WiFi.localIP());
}

/* ==== Encrypted Wi-Fi provisioning  (WIFI_CONFIG SysEx — see the constants above)
     Active creds = NVS-provisioned (if any) else the compile-time WIFI_SSID/PASS.
     A client hands over new creds via an ephemeral X25519 ECDH handshake
     (HKDF-SHA256 -> AES-256-GCM), typically over BLE while Wi-Fi is down.
   ==================== */
static Preferences wcPrefs;
static String      g_ssid, g_pass;
static bool        g_credsLoaded = false;

static void wcLoadCreds() {
  if (g_credsLoaded) return;
  wcPrefs.begin("wifiprov", true);                  // read-only
  g_ssid = wcPrefs.getString("ssid", WIFI_SSID);    // fall back to compile-time
  g_pass = wcPrefs.getString("pass", WIFI_PASS);
  wcPrefs.end();
  g_credsLoaded = true;
}

// (Re)connect Wi-Fi with the active creds; restart Bonjour/TCP on success.
static bool wcConnect() {
  // Already on the target network? Don't tear down a working link (this also lets
  // a re-provision over TCP send its reply before the socket would drop).
  if (WiFi.status() == WL_CONNECTED && WiFi.SSID() == g_ssid && WiFi.psk() == g_pass) {
    if (!wifiReady) startTcpServices();
    return true;
  }
  WiFi.disconnect(false, true);
  wifiReady = false;
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.setHostname(MDNS_HOSTNAME);
  WiFi.begin(g_ssid.c_str(), g_pass.c_str());
  uint8_t tries = 0;
  while (WiFi.status() != WL_CONNECTED && tries < 30) { delay(400); tries++; }   // ~12 s
  if (WiFi.status() == WL_CONNECTED) { startTcpServices(); return true; }
  return false;
}

