doraorak/ESP32Firmata/ESP32Firmata.ino
// Drop the current TCP client (used when another transport takes the board).
static void tcpDrop() {
  if (tcpClient && tcpClient.connected()) {
    tcpClient.stop();
    LOGLN("Evicted TCP client (latest-wins)");
  }
}

static void tcpSend(const uint8_t *buf, size_t len) {
  if (tcpClient && tcpClient.connected()) tcpClient.write(buf, len);
}

static void tcpPoll() {
  // Track Wi-Fi up/down without blocking (the stack auto-reconnects).
  if (WiFi.status() != WL_CONNECTED) {
    if (wifiReady) { wifiReady = false; LOGLN("Wi-Fi lost"); }
    return;
  }
  if (!wifiReady) startTcpServices();   // (re)connected — (re)start services

  // Accept a newly arriving client. A new TCP connection always wins: it
  // replaces any previous TCP client and (via claimMaster) evicts a BLE master.
  WiFiClient incoming = tcpServer.available();
  if (incoming) {
    if (tcpClient && tcpClient.connected()) {                  // within-TCP replace
      uint8_t nb[24];
      tcpClient.write(nb, buildEvictionFrame(nb));             // courtesy notice
      tcpClient.stop();
    }
    tcpClient = incoming;
    tcpClient.setNoDelay(true);
    LOGLN("TCP client connected");
    claimMaster(TR_TCP);
  }
  // Release mastership if our client went away.
  if (activeTransport == TR_TCP && (!tcpClient || !tcpClient.connected())) {
    activeTransport = TR_NONE;
  }
  for (int guard = 0; tcpClient && tcpClient.available() && guard < 1024; guard++) {
    liveHandler.process((uint8_t)tcpClient.read());
  }
}

#endif // ENABLE_WIFI

/* ==== TRANSPORT — BLE (Nordic UART Service) ============================= */
#if ENABLE_BLE

#define NUS_SERVICE_UUID "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_RX_UUID      "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"  // host -> device
#define NUS_TX_UUID      "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"  // device -> host

static NimBLEServer         *bleServer = nullptr;
static NimBLECharacteristic *txChar    = nullptr;
static volatile bool      bleConnected = false;   // a central currently holds the link
static volatile uint16_t  bleConnId   = 0;        // its connection id
static volatile bool      bleNewConnect = false;  // edge flag: a central just connected
static bool               bleWasConnected = false;
static volatile uint16_t  negotiatedMTU = 23;

// Lock-protected ring buffer for bytes arriving in the BLE task context.
static const int RXBUF_SIZE = 2048;
static volatile uint8_t   rxbuf[RXBUF_SIZE];
static volatile int       rxHead = 0, rxTail = 0;
static portMUX_TYPE       rxMux = portMUX_INITIALIZER_UNLOCKED;

static void rxEnqueue(const uint8_t *d, size_t n) {
  portENTER_CRITICAL(&rxMux);
  for (size_t i = 0; i < n; i++) {
    int nh = (rxHead + 1) % RXBUF_SIZE;
    if (nh != rxTail) { rxbuf[rxHead] = d[i]; rxHead = nh; }
  }
  portEXIT_CRITICAL(&rxMux);
}

static int rxDequeue() {
  int r = -1;
  portENTER_CRITICAL(&rxMux);
  if (rxTail != rxHead) { r = rxbuf[rxTail]; rxTail = (rxTail + 1) % RXBUF_SIZE; }
  portEXIT_CRITICAL(&rxMux);
  return r;
}

class RxCallbacks : public NimBLECharacteristicCallbacks {
  void onWrite(NimBLECharacteristic *c, NimBLEConnInfo &) override {
    NimBLEAttValue v = c->getValue();
    if (v.length()) rxEnqueue(v.data(), v.length());
  }
};

class ServerCallbacks : public NimBLEServerCallbacks {
  // Use the conn handle so we can do latest-wins across multiple centrals.
  void onConnect(NimBLEServer *s, NimBLEConnInfo &connInfo) override {
    uint16_t newConn = connInfo.getConnHandle();
    if (bleConnected && bleConnId != newConn) {
      s->disconnect(bleConnId);     // a new central wins: drop the previous one
    }
    bleConnId     = newConn;
    bleConnected  = true;
    bleNewConnect = true;           // loop() will claim mastership
    NimBLEDevice::startAdvertising();  // keep advertising so the board stays reclaimable
  }
  void onDisconnect(NimBLEServer *s, NimBLEConnInfo &connInfo, int reason) override {
    if (connInfo.getConnHandle() == bleConnId) {   // the *current* master left
      bleConnected = false;
      negotiatedMTU = 23;
    }
    NimBLEDevice::startAdvertising();
  }
  void onMTUChange(uint16_t MTU, NimBLEConnInfo &) override {
    negotiatedMTU = MTU;
  }
};

static void bleInit() {
  NimBLEDevice::init(BLE_DEVICE_NAME);
  NimBLEDevice::setMTU(517);  // request a large MTU (host has final say)

  bleServer = NimBLEDevice::createServer();
  bleServer->setCallbacks(new ServerCallbacks());

  NimBLEService *svc = bleServer->createService(NUS_SERVICE_UUID);

  NimBLECharacteristic *rxChar = svc->createCharacteristic(
      NUS_RX_UUID, NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::WRITE_NR);
  rxChar->setCallbacks(new RxCallbacks());

  // NimBLE auto-adds the 0x2902 CCCD for a NOTIFY characteristic.
  txChar = svc->createCharacteristic(NUS_TX_UUID, NIMBLE_PROPERTY::NOTIFY);

  svc->start();

  /* The 128-bit service UUID goes in the advertisement (required for the client's
     service-filtered scan); the name rides in the scan response so both fit the
     31-byte limit (NimBLE moves the name there when scan response is enabled). */
  NimBLEAdvertising *adv = NimBLEDevice::getAdvertising();
  adv->addServiceUUID(NUS_SERVICE_UUID);
  adv->setName(BLE_DEVICE_NAME);
  adv->enableScanResponse(true);
  NimBLEDevice::startAdvertising();
  LOGF("BLE advertising as \"%s\" (Nordic UART Service)\n", BLE_DEVICE_NAME);
}

// Drop the current BLE central (used when another transport takes the board).
static void bleDrop() {
  if (bleConnected && bleServer) {
    bleServer->disconnect(bleConnId);
    LOGLN("Evicted BLE central (latest-wins)");
  }
}

static void blePoll() {
  if (bleNewConnect) {
    bleNewConnect = false;
    bleWasConnected = true;
    LOGLN("BLE central connected");
    claimMaster(TR_BLE);
  } else if (!bleConnected && bleWasConnected) {
    bleWasConnected = false;
    if (activeTransport == TR_BLE) activeTransport = TR_NONE;
    LOGLN("BLE central disconnected");
  }
  int b;
  int guard = 0;
  while ((b = rxDequeue()) >= 0 && guard++ < 4096) liveHandler.process((uint8_t)b);
}

static void bleSend(const uint8_t *buf, size_t len) {
  if (!bleConnected || !txChar) return;
  size_t chunk = (negotiatedMTU > 23) ? (size_t)(negotiatedMTU - 3) : 20;
  size_t off = 0;
  while (off < len) {
    size_t n = (len - off < chunk) ? (len - off) : chunk;
    txChar->setValue((uint8_t *)(buf + off), n);
    txChar->notify();
    off += n;
    if (off < len) delay(6);  // pace notifications so none are dropped
  }
}

