doraorak/ESP32Firmata/ESP32Firmata.ino
#endif // ENABLE_BLE

/* ==== TRANSPORT — unified front-end (master arbitration) ================ */

// Make `who` the single board master, evicting the other transport's holder.
static void claimMaster(ActiveTransport who) {
  /* Courtesy notice to the outgoing (cross-transport) master before we drop it.
     sendFrame() still routes to the *old* master here (activeTransport not yet
     updated). Best-effort; a small delay lets a BLE notify flush before disconnect. */
  if (activeTransport != TR_NONE && activeTransport != who) {
    uint8_t nb[24];
    sendFrame(nb, buildEvictionFrame(nb));
    delay(15);
  }
#if ENABLE_WIFI
  if (who != TR_TCP) tcpDrop();
#endif
#if ENABLE_BLE
  if (who != TR_BLE) bleDrop();
#endif
  activeTransport = who;
  onNewConnection();   // fresh session (keeps pins + scheduler tasks)
}

static void transportInit() {
#if ENABLE_WIFI
  tcpInit();
#endif
#if ENABLE_BLE
  bleInit();
#endif
}

/* Firmata over USB serial (UART0 — the log console port). The first byte a host
   sends claims the session: the console goes quiet and serial stays master until
   another transport claims it or the board reboots (there is no disconnect event). */
static void serialPoll() {
  int guard = 0;
  while (Serial.available() && guard < 1024) {
    int b = Serial.read();
    if (b < 0) break;
    if (activeTransport != TR_SERIAL) {
      consoleQuiet = true;
      esp_log_level_set("*", ESP_LOG_NONE);
      claimMaster(TR_SERIAL);
    }
    liveHandler.process((uint8_t)b);
    guard++;
  }
}

static void transportPoll() {
#if ENABLE_WIFI
  tcpPoll();
#endif
#if ENABLE_BLE
  blePoll();
#endif
  serialPoll();
}

static void sendFrame(const uint8_t *buf, size_t len) {
#if ENABLE_WIFI
  if (activeTransport == TR_TCP) { tcpSend(buf, len); return; }
#endif
#if ENABLE_BLE
  if (activeTransport == TR_BLE) { bleSend(buf, len); return; }
#endif
  if (activeTransport == TR_SERIAL) { Serial.write(buf, len); return; }
}

static bool transportConnected() { return activeTransport != TR_NONE; }


/* ==== Arduino entry points ============================================== */
void setup() {
  for (uint8_t i = 0; i < TOTAL_PINS; i++) { servoMinUs[i] = 544; servoMaxUs[i] = 2400; pwmMaxDuty[i] = 255; }
  Serial.begin(115200);
  delay(200);
  LOGLN();
  LOGF("=== ESP32 Firmata: %s ===\n", FIRMWARE_NAME);

  analogReadResolution(12);
#if defined(ADC_11db)
  analogSetAttenuation(ADC_11db);
#endif

  // Wire the handler/scheduler cross-references (singletons that live forever).
  liveHandler.sched   = &scheduler;
  replayHandler.sched = &scheduler;
  scheduler.replay    = &replayHandler;

  systemResetState();
  transportInit();
}

void loop() {
  transportPoll();
  moduleTick();
  toneTick();               // auto-stop any timed tones (cheap when none pending)

  // Scheduler runs whether or not a client is connected — that is the whole
  // point: queue a task, disconnect, and the board keeps executing it.
  scheduler.tick();

  if (transportConnected()) {
    checkDigitalInputs();
    unsigned long now = millis();
    if (now - lastSampleMs >= samplingInterval) {
      lastSampleMs = now;
      sampleAnalogAndI2C();
    }
  }
}
